ruby/M.org
#+TITLE:     M
#+AUTHOR:    Hao Ruan
#+EMAIL:     haoru@cisco.com
#+LANGUAGE:  en
#+LINK_HOME: http://www.github.com/ruanhao
#+OPTIONS:   h:6 html-postamble:nil html-preamble:t tex:t f:t ^:nil
#+STARTUP:   showall
#+TOC:       headlines 3
#+HTML_DOCTYPE: <!DOCTYPE html>
#+HTML_HEAD: <link href="http://fonts.googleapis.com/css?family=Roboto+Slab:400,700|Inconsolata:400,700" rel="stylesheet" type="text/css" />
#+HTML_HEAD: <link href="../org-html-themes/solarized/style.css" rel="stylesheet" type="text/css" />
 #+HTML: <div class="outline-2" id="meta">
| Author   | {{{author}}} ({{{email}}})    |
| Date     | {{{time(%Y-%m-%d %H:%M:%S)}}} |
#+HTML: <a href="#bottom">⇩</a>
#+HTML: <a id="top"/>
#+HTML: </div>

* [[https://wordsinasentence.com/misanthrope-in-a-sentence/][Misanthrope]]

  =a person who hates or distrusts humankind=

  - The old man was a misanthrope who surrounded his entire yard with barbed wire to keep his neighbors *at bay*.
  - Because the hermit lived far away from the village, everyone thought he was a misanthrope who hated the world.
  - After I was kidnapped and held hostage for a week, I became a misanthrope and distrusted everyone.
  - Living in a crime-filled city will turn anyone into a nervous misanthrope.
  - The librarian at my school is a misanthrope who stares angrily at everyone who enters the library.
  - Even though Larry is outgoing and sociable today, he was once a misanthrope who never left his house.
  - Sarah’s grandmother is a misanthrope who hates everyone.



* [[https://wordsinasentence.com/mischievous-in-a-sentence/][Mischievous]]

  =badly behaved; naughty=

  - Garry’s dog is very mischievous so don’t *be thrown off* =错觉= by its cute smile.
  - Everything was going well until our mischievous 6-year-old decided to stick his hand into the living room fan.
  - The police warned us not to engage in any kind of mischievous behavior on the boardwalk.
  - Although Martha is a serious student, she does have a mischievous side to her.



* [[https://wordsinasentence.com/misnomer-in-a-sentence/][Misnomer]]

  =a name or description that is incorrect or inappropriate=

  - Since Fred is very skinny, calling him Fat Fred is indeed a misnomer.
  - The foreigner found it difficult to understand the local misnomer which described a bar as a watering hole.
  - Because my grandmother had a habit of saying inappropriate things, it was not surprising to hear one misnomer after another coming out of her mouth.
  - The name she chose made no sense to anyone so we could only assume it was a misnomer.
  - No one can understand why my aunt has given her friendly dog the misnomer of Killer.
  - Although there was a misnomer in the contract, the judge still said the terms were legal and binding.
  - Labeling the product as low-fat is a bit of a misnomer because the item’s actual fat content is really quite high.



* [[https://wordsinasentence.com/misogyny-in-a-sentence/][Misogyny]]

  =an intense dislike of females=

  - The boy’s misogyny *hailed from* =来源于= the abuse he suffered from his mother.
  - In my opinion, our professor allows his misogyny to give women lower grades than men despite the work quality.
  - The women’s basketball team refused to work with their coach because of his misogyny and his rude behavior.
  - According to the criminal profiler, only a person with misogyny could kill so many women so brutally.



