ruby/M.html
<!DOCTYPE html>
<html>
<head>
<title>M</title>
<!-- 2018-06-04 Mon 23:42 -->
<meta  charset="utf-8">
<meta  name="generator" content="Org-mode">
<meta  name="author" content="Hao Ruan">
<link href="http://fonts.googleapis.com/css?family=Roboto+Slab:400,700|Inconsolata:400,700" rel="stylesheet" type="text/css" />
<link href="../org-html-themes/solarized/style.css" rel="stylesheet" type="text/css" />
</head>
<body>
<div id="content">
<h1 class="title">M</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Misanthrope</a></li>
<li><a href="#sec-2">2. Mischievous</a></li>
<li><a href="#sec-3">3. Misnomer</a></li>
<li><a href="#sec-4">4. Misogyny</a></li>
<li><a href="#sec-5">5. Mite</a></li>
<li><a href="#sec-6">6. Mollify</a></li>
<li><a href="#sec-7">7. Monolithic</a></li>
<li><a href="#sec-8">8. Monotony</a></li>
<li><a href="#sec-9">9. Monumental</a></li>
<li><a href="#sec-10">10. Moralistic</a></li>
<li><a href="#sec-11">11. Moratorium</a></li>
<li><a href="#sec-12">12. Morbid</a></li>
<li><a href="#sec-13">13. Mordant</a></li>
<li><a href="#sec-14">14. Morose</a></li>
<li><a href="#sec-15">15. Mortify</a></li>
<li><a href="#sec-16">16. Motif</a></li>
<li><a href="#sec-17">17. Motley</a></li>
<li><a href="#sec-18">18. Movement</a></li>
<li><a href="#sec-19">19. Muddle</a></li>
<li><a href="#sec-20">20. Mundane</a></li>
<li><a href="#sec-21">21. Munificent</a></li>
<li><a href="#sec-22">22. Machination</a></li>
<li><a href="#sec-23">23. Magniloquent</a></li>
<li><a href="#sec-24">24. Malaise</a></li>
<li><a href="#sec-25">25. Malediction</a></li>
<li><a href="#sec-26">26. Malefactor</a></li>
<li><a href="#sec-27">27. Maleficent</a></li>
<li><a href="#sec-28">28. Malfeasance</a></li>
<li><a href="#sec-29">29. Mandate</a></li>
<li><a href="#sec-30">30. Mangle</a></li>
<li><a href="#sec-31">31. Manifesto</a></li>
<li><a href="#sec-32">32. Mar</a></li>
<li><a href="#sec-33">33. Marauding</a></li>
<li><a href="#sec-34">34. Martyr</a></li>
<li><a href="#sec-35">35. Marvel</a></li>
<li><a href="#sec-36">36. Mast</a></li>
<li><a href="#sec-37">37. Masticate</a></li>
<li><a href="#sec-38">38. Materialize</a></li>
<li><a href="#sec-39">39. Matriculate</a></li>
<li><a href="#sec-40">40. Matte</a></li>
<li><a href="#sec-41">41. Maul</a></li>
<li><a href="#sec-42">42. Mawkish</a></li>
<li><a href="#sec-43">43. Meander</a></li>
<li><a href="#sec-44">44. Measly</a></li>
<li><a href="#sec-45">45. Meek</a></li>
<li><a href="#sec-46">46. Meld</a></li>
<li><a href="#sec-47">47. Mellifluous</a></li>
<li><a href="#sec-48">48. Menace</a></li>
<li><a href="#sec-49">49. Mendacious</a></li>
<li><a href="#sec-50">50. Mendacity</a></li>
<li><a href="#sec-51">51. Mendicant</a></li>
<li><a href="#sec-52">52. Mesmerized</a></li>
<li><a href="#sec-53">53. Mete</a></li>
<li><a href="#sec-54">54. Mettle</a></li>
<li><a href="#sec-55">55. Mien</a></li>
<li><a href="#sec-56">56. Miffed</a></li>
<li><a href="#sec-57">57. Militia</a></li>
<li><a href="#sec-58">58. Mingle</a></li>
<li><a href="#sec-59">59. Mirth</a></li>
<li><a href="#sec-60">60. Miscreant</a></li>
<li><a href="#sec-61">61. Misgiving</a></li>
<li><a href="#sec-62">62. Mistrial</a></li>
<li><a href="#sec-63">63. Moan</a></li>
<li><a href="#sec-64">64. Moat</a></li>
<li><a href="#sec-65">65. Modicum</a></li>
<li><a href="#sec-66">66. Mollify</a></li>
<li><a href="#sec-67">67. Mollycoddle</a></li>
<li><a href="#sec-68">68. Monograph</a></li>
<li><a href="#sec-69">69. Monsoon</a></li>
<li><a href="#sec-70">70. Mope</a></li>
<li><a href="#sec-71">71. Mores</a></li>
<li><a href="#sec-72">72. Morsel</a></li>
<li><a href="#sec-73">73. Mortification</a></li>
<li><a href="#sec-74">74. Mote</a></li>
<li><a href="#sec-75">75. Motility</a></li>
<li><a href="#sec-76">76. Muck</a></li>
<li><a href="#sec-77">77. Muffle</a></li>
<li><a href="#sec-78">78. Mull</a></li>
<li><a href="#sec-79">79. Mumble</a></li>
<li><a href="#sec-80">80. Muse</a></li>
<li><a href="#sec-81">81. Mushy</a></li>
<li><a href="#sec-82">82. Muster</a></li>
<li><a href="#sec-83">83. Mutinous</a></li>
<li><a href="#sec-84">84. Mutter</a></li>
</ul>
</div>
</div>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Misanthrope</a></li>
<li><a href="#sec-2">2. Mischievous</a></li>
<li><a href="#sec-3">3. Misnomer</a></li>
<li><a href="#sec-4">4. Misogyny</a></li>
<li><a href="#sec-5">5. Mite</a></li>
<li><a href="#sec-6">6. Mollify</a></li>
<li><a href="#sec-7">7. Monolithic</a></li>
<li><a href="#sec-8">8. Monotony</a></li>
<li><a href="#sec-9">9. Monumental</a></li>
<li><a href="#sec-10">10. Moralistic</a></li>
<li><a href="#sec-11">11. Moratorium</a></li>
<li><a href="#sec-12">12. Morbid</a></li>
<li><a href="#sec-13">13. Mordant</a></li>
<li><a href="#sec-14">14. Morose</a></li>
<li><a href="#sec-15">15. Mortify</a></li>
<li><a href="#sec-16">16. Motif</a></li>
<li><a href="#sec-17">17. Motley</a></li>
<li><a href="#sec-18">18. Movement</a></li>
<li><a href="#sec-19">19. Muddle</a></li>
<li><a href="#sec-20">20. Mundane</a></li>
<li><a href="#sec-21">21. Munificent</a></li>
<li><a href="#sec-22">22. Machination</a></li>
<li><a href="#sec-23">23. Magniloquent</a></li>
<li><a href="#sec-24">24. Malaise</a></li>
<li><a href="#sec-25">25. Malediction</a></li>
<li><a href="#sec-26">26. Malefactor</a></li>
<li><a href="#sec-27">27. Maleficent</a></li>
<li><a href="#sec-28">28. Malfeasance</a></li>
<li><a href="#sec-29">29. Mandate</a></li>
<li><a href="#sec-30">30. Mangle</a></li>
<li><a href="#sec-31">31. Manifesto</a></li>
<li><a href="#sec-32">32. Mar</a></li>
<li><a href="#sec-33">33. Marauding</a></li>
<li><a href="#sec-34">34. Martyr</a></li>
<li><a href="#sec-35">35. Marvel</a></li>
<li><a href="#sec-36">36. Mast</a></li>
<li><a href="#sec-37">37. Masticate</a></li>
<li><a href="#sec-38">38. Materialize</a></li>
<li><a href="#sec-39">39. Matriculate</a></li>
<li><a href="#sec-40">40. Matte</a></li>
<li><a href="#sec-41">41. Maul</a></li>
<li><a href="#sec-42">42. Mawkish</a></li>
<li><a href="#sec-43">43. Meander</a></li>
<li><a href="#sec-44">44. Measly</a></li>
<li><a href="#sec-45">45. Meek</a></li>
<li><a href="#sec-46">46. Meld</a></li>
<li><a href="#sec-47">47. Mellifluous</a></li>
<li><a href="#sec-48">48. Menace</a></li>
<li><a href="#sec-49">49. Mendacious</a></li>
<li><a href="#sec-50">50. Mendacity</a></li>
<li><a href="#sec-51">51. Mendicant</a></li>
<li><a href="#sec-52">52. Mesmerized</a></li>
<li><a href="#sec-53">53. Mete</a></li>
<li><a href="#sec-54">54. Mettle</a></li>
<li><a href="#sec-55">55. Mien</a></li>
<li><a href="#sec-56">56. Miffed</a></li>
<li><a href="#sec-57">57. Militia</a></li>
<li><a href="#sec-58">58. Mingle</a></li>
<li><a href="#sec-59">59. Mirth</a></li>
<li><a href="#sec-60">60. Miscreant</a></li>
<li><a href="#sec-61">61. Misgiving</a></li>
<li><a href="#sec-62">62. Mistrial</a></li>
<li><a href="#sec-63">63. Moan</a></li>
<li><a href="#sec-64">64. Moat</a></li>
<li><a href="#sec-65">65. Modicum</a></li>
<li><a href="#sec-66">66. Mollify</a></li>
<li><a href="#sec-67">67. Mollycoddle</a></li>
<li><a href="#sec-68">68. Monograph</a></li>
<li><a href="#sec-69">69. Monsoon</a></li>
<li><a href="#sec-70">70. Mope</a></li>
<li><a href="#sec-71">71. Mores</a></li>
<li><a href="#sec-72">72. Morsel</a></li>
<li><a href="#sec-73">73. Mortification</a></li>
<li><a href="#sec-74">74. Mote</a></li>
<li><a href="#sec-75">75. Motility</a></li>
<li><a href="#sec-76">76. Muck</a></li>
<li><a href="#sec-77">77. Muffle</a></li>
<li><a href="#sec-78">78. Mull</a></li>
<li><a href="#sec-79">79. Mumble</a></li>
<li><a href="#sec-80">80. Muse</a></li>
<li><a href="#sec-81">81. Mushy</a></li>
<li><a href="#sec-82">82. Muster</a></li>
<li><a href="#sec-83">83. Mutinous</a></li>
<li><a href="#sec-84">84. Mutter</a></li>
</ul>
</div>
</div>
<div class="outline-2" id="meta">
<table>


<colgroup>
<col  class="left">

<col  class="left">
</colgroup>
<tbody>
<tr>
<td class="left">Author</td>
<td class="left">Hao Ruan (haoru@cisco.com)</td>
</tr>

<tr>
<td class="left">Date</td>
<td class="left">2018-06-04 23:42:13</td>
</tr>
</tbody>
</table>
<a href="#bottom">⇩</a>
<a id="top"/>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> <a href="https://wordsinasentence.com/misanthrope-in-a-sentence/">Misanthrope</a></h2>
<div class="outline-text-2" id="text-1">
<p>
<code>a person who hates or distrusts humankind</code>
</p>

<ul class="org-ul">
<li>The old man was a misanthrope who surrounded his entire yard with barbed wire to keep his neighbors at bay.
</li>
<li>Because the hermit lived far away from the village, everyone thought he was a misanthrope who hated the world.
</li>
<li>After I was kidnapped and held hostage for a week, I became a misanthrope and distrusted everyone.
</li>
<li>Living in a crime-filled city will turn anyone into a nervous misanthrope.
</li>
<li>The librarian at my school is a misanthrope who stares angrily at everyone who enters the library.
</li>
<li>Even though Larry is outgoing and sociable today, he was once a misanthrope who never left his house.
</li>
<li>Sarah’s grandmother is a misanthrope who hates everyone.
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> <a href="https://wordsinasentence.com/mischievous-in-a-sentence/">Mischievous</a></h2>
<div class="outline-text-2" id="text-2">
<p>
<code>badly behaved; naughty</code>
</p>

<ul class="org-ul">
<li>Garry’s dog is very mischievous so don’t be thrown off by its cute smile.
</li>
<li>Everything was going well until our mischievous 6-year-old decided to stick his hand into the living room fan.
</li>
<li>The police warned us not to engage in any kind of mischievous behavior on the boardwalk.
</li>
<li>Although Martha is a serious student, she does have a mischievous side to her.
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> <a href="https://wordsinasentence.com/misnomer-in-a-sentence/">Misnomer</a></h2>
<div class="outline-text-2" id="text-3">
<p>
<code>a name or description that is incorrect or inappropriate</code>
</p>

<ul class="org-ul">
<li>Since Fred is very skinny, calling him Fat Fred is indeed a misnomer.
</li>
<li>The foreigner found it difficult to understand the local misnomer which described a bar as a watering hole.
</li>
<li>Because my grandmother had a habit of saying inappropriate things, it was not surprising to hear one misnomer after another coming out of her mouth.
</li>
<li>The name she chose made no sense to anyone so we could only assume it was a misnomer.
</li>
<li>No one can understand why my aunt has given her friendly dog the misnomer of Killer.
</li>
<li>Although there was a misnomer in the contract, the judge still said the terms were legal and binding.
</li>
<li>Labeling the product as low-fat is a bit of a misnomer because the item’s actual fat content is really quite high.
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> <a href="https://wordsinasentence.com/misogyny-in-a-sentence/">Misogyny</a></h2>
<div class="outline-text-2" id="text-4">
<p>
<code>an intense dislike of females</code>
</p>

<ul class="org-ul">
<li>The boy’s misogyny hailed from the abuse he suffered from his mother.
</li>
<li>In my opinion, our professor allows his misogyny to give women lower grades than men despite the work quality.
</li>
<li>The women’s basketball team refused to work with their coach because of his misogyny and his rude behavior.
</li>
<li>According to the criminal profiler, only a person with misogyny could kill so many women so brutally.
</li>
</ul>
</div>
</div>
