ruby/M.org
* [[https://wordsinasentence.com/mite-in-a-sentence/][Mite]]

  =a little or slightly=

  - The man was acting a mite suspicious, enough that the cops stopped him to find out what he was up to.
  - If someone is driving in a manner that is a mite uncontrolled and wild, the police might pull them over to make sure they are not under the influence of alcohol.
  - My friend is only a mite funny, but he thinks he is the most humorous among us, even though his jokes are average at best.
  - The server that brought our food to us was a mite strange, but he was a kind person under all of that eccentricity.



* [[https://wordsinasentence.com/mollify-in-a-sentence/][Mollify]]

  =to soothe in temper or disposition=

  - I am hoping the hot tea and crackers will mollify my husband and help him relax.
  - If John Smith wants to win the election, he will have to mollify the voters he angered during last week’s debate.
  - Perhaps a warm glass of milk will mollify my upset stomach.
  - When the baby started to cry, his mother tried to mollify him with a bottle of milk.
  - Whenever I do something wrong, I make an apology to mollify the person I offended.
  - After breaking my favorite plate, my little boy tried to mollify me with a kiss on my cheek.
  - When Jake forgot his wedding anniversary, he tried to mollify his wife by giving her a diamond necklace.



* [[https://wordsinasentence.com/monolithic-in-a-sentence/][Monolithic]]

  =large in size and challenging to alter=

  - Unfortunately there was no way to make the monolithic project smaller.
  - It will take over a year to complete the monolithic task of rebuilding the museum.
  - Since the changes are not monolithic, it should only take Sarah a day or two to remodel the kitchen.
  - It will take the decoders weeks to decipher the monolithic amount of code.
  - Because the cult leader’s *brainwashing* was so monolithic, it took months for the man to break free of the programming.
  - The miners were exhausted after smashing through the monolithic cave wall.
  - If the monolithic pillars collapse, the entire building will fall.


* [[https://wordsinasentence.com/monotony-in-a-sentence/][Monotony]]

  =repetition or lack of change that makes something boring=

  - Adding seasoning to the bland stew helped break up the monotony of the dish.
  - Our boring schedule led to monotony, with each day being exactly like the one before.
  - After several hours of playing the same game, monotony *set in* =来临= and I looked for something else to do.
  - After five years in a lackluster marriage, the dreary couple went on a fun trip to break up the monotony.



* [[https://wordsinasentence.com/monumental-in-a-sentence/][Monumental]]

  =important; significant=

  - A monumental and historic decision was made by the Supreme Court regarding marriage rights.
  - The company has enjoyed monumental success this year, reaching record breaking heights.
  - Monumental change in the administration led to financial *scale backs* =相应缩减= of major proportions.
  - Although it was a monumental upset for the team, the coach encouraged the team to view the significant setback as a lesson.



* [[https://wordsinasentence.com/moralistic-in-a-sentence/][Moralistic]]

  =quick to judge others based on a narrow view of what is right and wrong=

  - The moralistic pastor called out members of his congregation for what he saw as sinful behaviors.
  - Being extremely moralistic, my judging neighbor always had something to say about my late night *co-ed* =男女混合的= parties.
  - The delusional man was unapologetically moralistic and felt it was his God given right to call others out on their wicked ways.
  - The conversation took a moralistic turn as my mother began to scold me for living a lifestyle she felt to be immoral.



* [[https://wordsinasentence.com/moratorium-in-a-sentence/][Moratorium]]

  =the pausing of an ongoing activity=

  - An avid fisherman, Billy was upset when he learned of the fishing moratorium.
  - A large number of politicians and voters would like to see a moratorium placed on home foreclosures.
  - Before the moratorium was passed, people were being executed practically every week in Texas.
  - Potential business owners are angry because the county has passed a moratorium on new business licenses.
  - When the commercial developers learned of a possible building moratorium, they immediately begin to petition the city council.
  - The fishing moratorium will end as soon as the government has completed its radiation testing on the lake.
  - Because of the deadly virus, many people are calling for a moratorium on flights from West Africa.



* [[https://wordsinasentence.com/morbid-in-a-sentence/][Morbid]]

  =associated with subjects that are unpleasant, like death=

  - The boy’s morbid fascination with death led him to collect dead animals.
  - Because Ellen has a morbid sense of humor, she often makes jokes about people dying.
  - Tom’s morbid curiosity with death drove him to work in the coroner’s office.
  - Although Hank didn’t know the deceased, he attended the funeral to explore his morbid interest in grieving families.



* [[https://wordsinasentence.com/mordant-in-a-sentence/][Mordant]]

  =having a scathing wit=

  - The mordant mother often used harsh words that made her son cry.
  - When the mordant president entered the boardroom, all of his vice-presidents readied for his sarcastic attacks.
  - The mordant *news anchor* =新闻主持人= lost his job after he made racist jokes on television.
  - Before I face my mordant mother-in-law at dinner, I must brace myself for her abrasive comments about my cooking.



* [[https://wordsinasentence.com/morose-in-a-sentence/][Morose]]

  =feeling sad, in a bad mood, and not wanting to talk to anyone=

  - When her dog died, the little girl was morose for months.
  - The funny movie was exactly what I needed to improve my morose mood.
  - After their team lost the basketball game, the disappointed fans looked morose.
  - Not surprisingly, his funeral was a morose event which left all the guests in tears.
  - While Edgar was not a morose individual, he pretended to be so that people would keep their distance.
  - My brother’s morose outlook on life did not even change when he won the million dollar sweepstakes.
  - In the movie, the leading character is a morose man who will do anything to avenge his wife’s death.



