ruby/M.html



<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> <a href="https://wordsinasentence.com/mite-in-a-sentence/">Mite</a></h2>
<div class="outline-text-2" id="text-5">
<p>
<code>a little or slightly</code>
</p>

<ul class="org-ul">
<li>The man was acting a mite suspicious, enough that the cops stopped him to find out what he was up to.
</li>
<li>If someone is driving in a manner that is a mite uncontrolled and wild, the police might pull them over to make sure they are not under the influence of alcohol.
</li>
<li>My friend is only a mite funny, but he thinks he is the most humorous among us, even though his jokes are average at best.
</li>
<li>The server that brought our food to us was a mite strange, but he was a kind person under all of that eccentricity.
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> <a href="https://wordsinasentence.com/mollify-in-a-sentence/">Mollify</a></h2>
<div class="outline-text-2" id="text-6">
<p>
<code>to soothe in temper or disposition</code>
</p>

<ul class="org-ul">
<li>I am hoping the hot tea and crackers will mollify my husband and help him relax.
</li>
<li>If John Smith wants to win the election, he will have to mollify the voters he angered during last week’s debate.
</li>
<li>Perhaps a warm glass of milk will mollify my upset stomach.
</li>
<li>When the baby started to cry, his mother tried to mollify him with a bottle of milk.
</li>
<li>Whenever I do something wrong, I make an apology to mollify the person I offended.
</li>
<li>After breaking my favorite plate, my little boy tried to mollify me with a kiss on my cheek.
</li>
<li>When Jake forgot his wedding anniversary, he tried to mollify his wife by giving her a diamond necklace.
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> <a href="https://wordsinasentence.com/monolithic-in-a-sentence/">Monolithic</a></h2>
<div class="outline-text-2" id="text-7">
<p>
<code>large in size and challenging to alter</code>
</p>

<ul class="org-ul">
<li>Unfortunately there was no way to make the monolithic project smaller.
</li>
<li>It will take over a year to complete the monolithic task of rebuilding the museum.
</li>
<li>Since the changes are not monolithic, it should only take Sarah a day or two to remodel the kitchen.
</li>
<li>It will take the decoders weeks to decipher the monolithic amount of code.
</li>
<li>Because the cult leader’s brainwashing was so monolithic, it took months for the man to break free of the programming.
</li>
<li>The miners were exhausted after smashing through the monolithic cave wall.
</li>
<li>If the monolithic pillars collapse, the entire building will fall.
</li>
</ul>
</div>
</div>


<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> <a href="https://wordsinasentence.com/monotony-in-a-sentence/">Monotony</a></h2>
<div class="outline-text-2" id="text-8">
<p>
<code>repetition or lack of change that makes something boring</code>
</p>

<ul class="org-ul">
<li>Adding seasoning to the bland stew helped break up the monotony of the dish.
</li>
<li>Our boring schedule led to monotony, with each day being exactly like the one before.
</li>
<li>After several hours of playing the same game, monotony set in and I looked for something else to do.
</li>
<li>After five years in a lackluster marriage, the dreary couple went on a fun trip to break up the monotony.
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-9" class="outline-2">
<h2 id="sec-9"><span class="section-number-2">9</span> <a href="https://wordsinasentence.com/monumental-in-a-sentence/">Monumental</a></h2>
<div class="outline-text-2" id="text-9">
<p>
<code>important; significant</code>
</p>

<ul class="org-ul">
<li>A monumental and historic decision was made by the Supreme Court regarding marriage rights.
</li>
<li>The company has enjoyed monumental success this year, reaching record breaking heights.
</li>
<li>Monumental change in the administration led to financial scale backs of major proportions.
</li>
<li>Although it was a monumental upset for the team, the coach encouraged the team to view the significant setback as a lesson.
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-10" class="outline-2">
<h2 id="sec-10"><span class="section-number-2">10</span> <a href="https://wordsinasentence.com/moralistic-in-a-sentence/">Moralistic</a></h2>
<div class="outline-text-2" id="text-10">
<p>
<code>quick to judge others based on a narrow view of what is right and wrong</code>
</p>

<ul class="org-ul">
<li>The moralistic pastor called out members of his congregation for what he saw as sinful behaviors.
</li>
<li>Being extremely moralistic, my judging neighbor always had something to say about my late night co-ed parties.
</li>
<li>The delusional man was unapologetically moralistic and felt it was his God given right to call others out on their wicked ways.
</li>
<li>The conversation took a moralistic turn as my mother began to scold me for living a lifestyle she felt to be immoral.
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-11" class="outline-2">
<h2 id="sec-11"><span class="section-number-2">11</span> <a href="https://wordsinasentence.com/moratorium-in-a-sentence/">Moratorium</a></h2>
<div class="outline-text-2" id="text-11">
<p>
<code>the pausing of an ongoing activity</code>
</p>

<ul class="org-ul">
<li>An avid fisherman, Billy was upset when he learned of the fishing moratorium.
</li>
<li>A large number of politicians and voters would like to see a moratorium placed on home foreclosures.
</li>
<li>Before the moratorium was passed, people were being executed practically every week in Texas.
</li>
<li>Potential business owners are angry because the county has passed a moratorium on new business licenses.
</li>
<li>When the commercial developers learned of a possible building moratorium, they immediately begin to petition the city council.
</li>
<li>The fishing moratorium will end as soon as the government has completed its radiation testing on the lake.
</li>
<li>Because of the deadly virus, many people are calling for a moratorium on flights from West Africa.
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-12" class="outline-2">
<h2 id="sec-12"><span class="section-number-2">12</span> <a href="https://wordsinasentence.com/morbid-in-a-sentence/">Morbid</a></h2>
<div class="outline-text-2" id="text-12">
<p>
<code>associated with subjects that are unpleasant, like death</code>
</p>

<ul class="org-ul">
<li>The boy’s morbid fascination with death led him to collect dead animals.
</li>
<li>Because Ellen has a morbid sense of humor, she often makes jokes about people dying.
</li>
<li>Tom’s morbid curiosity with death drove him to work in the coroner’s office.
</li>
<li>Although Hank didn’t know the deceased, he attended the funeral to explore his morbid interest in grieving families.
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-13" class="outline-2">
<h2 id="sec-13"><span class="section-number-2">13</span> <a href="https://wordsinasentence.com/mordant-in-a-sentence/">Mordant</a></h2>
<div class="outline-text-2" id="text-13">
<p>
<code>having a scathing wit</code>
</p>

<ul class="org-ul">
<li>The mordant mother often used harsh words that made her son cry.
</li>
<li>When the mordant president entered the boardroom, all of his vice-presidents readied for his sarcastic attacks.
</li>
<li>The mordant news anchor lost his job after he made racist jokes on television.
</li>
<li>Before I face my mordant mother-in-law at dinner, I must brace myself for her abrasive comments about my cooking.
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-14" class="outline-2">
<h2 id="sec-14"><span class="section-number-2">14</span> <a href="https://wordsinasentence.com/morose-in-a-sentence/">Morose</a></h2>
<div class="outline-text-2" id="text-14">
<p>
<code>feeling sad, in a bad mood, and not wanting to talk to anyone</code>
</p>

<ul class="org-ul">
<li>When her dog died, the little girl was morose for months.
</li>
<li>The funny movie was exactly what I needed to improve my morose mood.
</li>
<li>After their team lost the basketball game, the disappointed fans looked morose.
</li>
<li>Not surprisingly, his funeral was a morose event which left all the guests in tears.
</li>
<li>While Edgar was not a morose individual, he pretended to be so that people would keep their distance.
</li>
<li>My brother’s morose outlook on life did not even change when he won the million dollar sweepstakes.
</li>
<li>In the movie, the leading character is a morose man who will do anything to avenge his wife’s death.
</li>
</ul>
</div>
</div>
