ruby/M.org
* [[https://wordsinasentence.com/mortify-in-a-sentence/][Mortify]]

  =to put someone in the position of being embarrassed=

  - If my mother picks me up from school in her pajamas, she will mortify me in front of my friends.
  - I am certain my sister meant to mortify me when she showed my date my baby pictures!
  - Because Janice was angry with her parents, she got drunk and tried to mortify them by dancing on the cake table at their Christmas party.
  - I was shocked when my husband tried to mortify me by bringing his mistress to my birthday party.
  - If Jared was trying to mortify his parents by yelling during the opera, he succeeded.
  - How could Alan mortify Carol by asking her for a divorce at their tenth anniversary party?
  - The class bully began to mortify the shy girl by making fun of her old clothes.



* [[https://wordsinasentence.com/motif-in-a-sentence/][Motif]]

  =a reappearing theme in a creative person’s work or style=

  - Death is the depressing motif that appears in each of the artist’s paintings.
  - When I decorate my house, I will beautify it with white, sandy, and blue colors to create a beach motif.
  - Unrequited love is a frequent motif in the playwright’s works.
  - As I walked through my aunt’s residence, my nose started to itch because of the intensity of the flower motif that covered her home.



* [[https://wordsinasentence.com/motley-in-a-sentence/][Motley]]

  =made up of strikingly different components=

  - The motley group of job applicants included a retired teacher, a recently released convict, and a sixteen-year-old girl.
  - When the ship’s captain looked for a crew, he found a motley gang of people with no sailing experience.
  - What was supposed to be soup was actually a motley concoction made of every item my wife had found in the cupboard.
  - Since the litter was a motley group, none of the puppies resembled each other.
  - The old computer lab contains a motley collection of ancient processors from a variety of personal computer manufacturers.
  - In the small country town, a motley troop of citizens made up the volunteer fire department.
  - Brad’s motley assortment of miniature vehicles covered a large portion of his bedroom floor.



* [[https://wordsinasentence.com/movement-in-a-sentence/][Movement]]

  =the process of changing places or positions=

  - Sudden movement in the back of the house sent the dogs barking and startled their sleeping owner.
  - The ballerina’s graceful movement across the stage wowed both the audience and the other dancers.
  - With movement of traffic coming to a complete stop, the hurried driver wished that he had taken a faster route to work.
  - Movement of all of the storage boxes took forever since only two workers and one dolly were on hand.



* [[https://wordsinasentence.com/muddle-in-a-sentence/][Muddle]]

  =to mess up or make confusing=

  - As the hostile driver continued to muddle the sobriety test, the police officer reached for his handcuffs.
  - Not eating properly can muddle a person’s thought processes.
  - Because Jane has no computer skills, she has managed to muddle our accounting records.
  - My talkative spouse can muddle the simplest explanation and make it seem extremely complicated.



* [[https://wordsinasentence.com/mundane-in-a-sentence/][Mundane]]

  =Boring, dull, and uninteresting=

  - The restaurant should *spice up* their menu and replace the dull and mundane dishes.
  - From the exciting to the mundane, I will share all of my experiences with you.
  - Though his friends were having a fun time at the bar, Kevin settled for a mundane evening at home.
  - Going about his everyday routine, the man’s mundane schedule had him bored to tears.
  - I wish we had a dishwasher to handle the mundane task of washing dishes every night.
  - The science experiment would be more interesting if the materials weren’t so mundane.
  - Most of the movies showing are mundane and would put viewers to sleep rather than make them last.



* [[https://wordsinasentence.com/munificent-in-a-sentence/][Munificent]]

  =very generous=

  - The wealthy actor always gives the members of his staff munificent appreciation gifts.
  - If you were lucky enough to buy that particular technology stock *early on*, then soon you will be receiving some munificent rewards.
  - The munificent woman is a well-known philanthropist who funds many university scholarships.
  - Even though Mr. Matthews has millions of dollars, he is not munificent and hates to give away any of his money.
  - The munificent man gave all of his inheritance to charity.
  - When I turned in the stolen property, I was thrilled to receive a munificent reward from the property owner.
  - All of the employees were pleased with their munificent bonuses.



* [[https://wordsinasentence.com/machination-in-a-sentence/][Machination]]

  =a scheme that is usually created for bad reasons=

  - After being caught running a machination against his political rival, the ruthless candidate lost the election.
  - The con artist’s victims quickly fell for his easy money machination.
  - Fortunately law enforcement stepped in before the crazed man could put his machination into action.
  - Reading about the criminals’ machination to rob the casino was enthralling.
  - In order to rob the heavily guarded mansion, the burglars knew they needed to devise a clever machination.
  - No one realized the terrorist’s machination would cause thousands of deaths.
  - Since Will had not studied for the test, he devised a machination by which he could get a copy of the exam before class.




* [[https://wordsinasentence.com/magniloquent-in-a-sentence/][Magniloquent]]

  =using high-sounding, boastful language=

  - He spoke in a magniloquent manner, drawing attention to himself.
  - When he relayed the story, he used a magniloquent voice to express the characters.
  - My professor used his magniloquent gestures to keep the class engaged.
  - The conductor’s wild motions made him seem very magniloquent.



