ruby/M.html



<div id="outline-container-sec-15" class="outline-2">
<h2 id="sec-15"><span class="section-number-2">15</span> <a href="https://wordsinasentence.com/mortify-in-a-sentence/">Mortify</a></h2>
<div class="outline-text-2" id="text-15">
<p>
<code>to put someone in the position of being embarrassed</code>
</p>

<ul class="org-ul">
<li>If my mother picks me up from school in her pajamas, she will mortify me in front of my friends.
</li>
<li>I am certain my sister meant to mortify me when she showed my date my baby pictures!
</li>
<li>Because Janice was angry with her parents, she got drunk and tried to mortify them by dancing on the cake table at their Christmas party.
</li>
<li>I was shocked when my husband tried to mortify me by bringing his mistress to my birthday party.
</li>
<li>If Jared was trying to mortify his parents by yelling during the opera, he succeeded.
</li>
<li>How could Alan mortify Carol by asking her for a divorce at their tenth anniversary party?
</li>
<li>The class bully began to mortify the shy girl by making fun of her old clothes.
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-16" class="outline-2">
<h2 id="sec-16"><span class="section-number-2">16</span> <a href="https://wordsinasentence.com/motif-in-a-sentence/">Motif</a></h2>
<div class="outline-text-2" id="text-16">
<p>
<code>a reappearing theme in a creative person’s work or style</code>
</p>

<ul class="org-ul">
<li>Death is the depressing motif that appears in each of the artist’s paintings.
</li>
<li>When I decorate my house, I will beautify it with white, sandy, and blue colors to create a beach motif.
</li>
<li>Unrequited love is a frequent motif in the playwright’s works.
</li>
<li>As I walked through my aunt’s residence, my nose started to itch because of the intensity of the flower motif that covered her home.
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-17" class="outline-2">
<h2 id="sec-17"><span class="section-number-2">17</span> <a href="https://wordsinasentence.com/motley-in-a-sentence/">Motley</a></h2>
<div class="outline-text-2" id="text-17">
<p>
<code>made up of strikingly different components</code>
</p>

<ul class="org-ul">
<li>The motley group of job applicants included a retired teacher, a recently released convict, and a sixteen-year-old girl.
</li>
<li>When the ship’s captain looked for a crew, he found a motley gang of people with no sailing experience.
</li>
<li>What was supposed to be soup was actually a motley concoction made of every item my wife had found in the cupboard.
</li>
<li>Since the litter was a motley group, none of the puppies resembled each other.
</li>
<li>The old computer lab contains a motley collection of ancient processors from a variety of personal computer manufacturers.
</li>
<li>In the small country town, a motley troop of citizens made up the volunteer fire department.
</li>
<li>Brad’s motley assortment of miniature vehicles covered a large portion of his bedroom floor.
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-18" class="outline-2">
<h2 id="sec-18"><span class="section-number-2">18</span> <a href="https://wordsinasentence.com/movement-in-a-sentence/">Movement</a></h2>
<div class="outline-text-2" id="text-18">
<p>
<code>the process of changing places or positions</code>
</p>

<ul class="org-ul">
<li>Sudden movement in the back of the house sent the dogs barking and startled their sleeping owner.
</li>
<li>The ballerina’s graceful movement across the stage wowed both the audience and the other dancers.
</li>
<li>With movement of traffic coming to a complete stop, the hurried driver wished that he had taken a faster route to work.
</li>
<li>Movement of all of the storage boxes took forever since only two workers and one dolly were on hand.
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-19" class="outline-2">
<h2 id="sec-19"><span class="section-number-2">19</span> <a href="https://wordsinasentence.com/muddle-in-a-sentence/">Muddle</a></h2>
<div class="outline-text-2" id="text-19">
<p>
<code>to mess up or make confusing</code>
</p>

<ul class="org-ul">
<li>As the hostile driver continued to muddle the sobriety test, the police officer reached for his handcuffs.
</li>
<li>Not eating properly can muddle a person’s thought processes.
</li>
<li>Because Jane has no computer skills, she has managed to muddle our accounting records.
</li>
<li>My talkative spouse can muddle the simplest explanation and make it seem extremely complicated.
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-20" class="outline-2">
<h2 id="sec-20"><span class="section-number-2">20</span> <a href="https://wordsinasentence.com/mundane-in-a-sentence/">Mundane</a></h2>
<div class="outline-text-2" id="text-20">
<p>
<code>Boring, dull, and uninteresting</code>
</p>

<ul class="org-ul">
<li>The restaurant should spice up their menu and replace the dull and mundane dishes.
</li>
<li>From the exciting to the mundane, I will share all of my experiences with you.
</li>
<li>Though his friends were having a fun time at the bar, Kevin settled for a mundane evening at home.
</li>
<li>Going about his everyday routine, the man’s mundane schedule had him bored to tears.
</li>
<li>I wish we had a dishwasher to handle the mundane task of washing dishes every night.
</li>
<li>The science experiment would be more interesting if the materials weren’t so mundane.
</li>
<li>Most of the movies showing are mundane and would put viewers to sleep rather than make them last.
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-21" class="outline-2">
<h2 id="sec-21"><span class="section-number-2">21</span> <a href="https://wordsinasentence.com/munificent-in-a-sentence/">Munificent</a></h2>
<div class="outline-text-2" id="text-21">
<p>
<code>very generous</code>
</p>

<ul class="org-ul">
<li>The wealthy actor always gives the members of his staff munificent appreciation gifts.
</li>
<li>If you were lucky enough to buy that particular technology stock early on, then soon you will be receiving some munificent rewards.
</li>
<li>The munificent woman is a well-known philanthropist who funds many university scholarships.
</li>
<li>Even though Mr. Matthews has millions of dollars, he is not munificent and hates to give away any of his money.
</li>
<li>The munificent man gave all of his inheritance to charity.
</li>
<li>When I turned in the stolen property, I was thrilled to receive a munificent reward from the property owner.
</li>
<li>All of the employees were pleased with their munificent bonuses.
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-22" class="outline-2">
<h2 id="sec-22"><span class="section-number-2">22</span> <a href="https://wordsinasentence.com/machination-in-a-sentence/">Machination</a></h2>
<div class="outline-text-2" id="text-22">
<p>
<code>a scheme that is usually created for bad reasons</code>
</p>

<ul class="org-ul">
<li>After being caught running a machination against his political rival, the ruthless candidate lost the election.
</li>
<li>The con artist’s victims quickly fell for his easy money machination.
</li>
<li>Fortunately law enforcement stepped in before the crazed man could put his machination into action.
</li>
<li>Reading about the criminals’ machination to rob the casino was enthralling.
</li>
<li>In order to rob the heavily guarded mansion, the burglars knew they needed to devise a clever machination.
</li>
<li>No one realized the terrorist’s machination would cause thousands of deaths.
</li>
<li>Since Will had not studied for the test, he devised a machination by which he could get a copy of the exam before class.
</li>
</ul>
</div>
</div>




<div id="outline-container-sec-23" class="outline-2">
<h2 id="sec-23"><span class="section-number-2">23</span> <a href="https://wordsinasentence.com/magniloquent-in-a-sentence/">Magniloquent</a></h2>
<div class="outline-text-2" id="text-23">
<p>
<code>using high-sounding, boastful language</code>
</p>

<ul class="org-ul">
<li>He spoke in a magniloquent manner, drawing attention to himself.
</li>
<li>When he relayed the story, he used a magniloquent voice to express the characters.
</li>
<li>My professor used his magniloquent gestures to keep the class engaged.
</li>
<li>The conductor’s wild motions made him seem very magniloquent.
</li>
</ul>
</div>
</div>
