ruby/M.org
* [[https://wordsinasentence.com/malaise-in-a-sentence/][Malaise]]

  =a feeling of general bodily discomfort, fatigue or unpleasantness=

  - Jason knew he was getting ill because of the malaise he had been experiencing for a few days.
  - Since Barbara felt the malaise was interfering with her daily life, she scheduled a doctor’s appointment.
  - Many citizens who live near the contaminated lake are complaining of a malaise that keeps them bedridden.
  - Even after the physician performed an examination, he was still unable to determine the factor causing his patient’s malaise.
  - When our boss announced upcoming salary cuts, many people in our office complained of malaise and job dissatisfaction.
  - Weeks before his heart attack, Jim kept mentioning how he was experiencing malaise and not feeling like his normal self.
  - On Valentine’s Day, many single women complain of malaise and loneliness.



* [[https://wordsinasentence.com/malediction-in-a-sentence/][Malediction]]

  =an evil speech or curse upon someone or something=

  - The witch’s malediction made the young princess fall into a deep sleep.
  - Before the *warlock* was imprisoned, he placed a malediction upon his captor’s families.
  - Sometimes my luck is so bad I believe someone has placed a malediction upon me.
  - As long as the king is under the wizard’s malediction, he will not recall his own identity.
  - The woman tried to kill her cheating husband by chanting a malediction.
  - According to the malediction, darkness will reign in the kingdom for the next fifty years.
  - Since all the women in my family suffer from depression, it appears we share a malediction.



* [[https://wordsinasentence.com/malefactor-in-a-sentence/][Malefactor]]

  =one who does evil=

  - For several years, the detective pursued the malefactor who had brutally killed the two children.
  - Hopefully, the hero will fatally injure the malefactor during the gunfight.
  - The dictator was a merciless malefactor who tortured his subjects for fun.
  - When the police questioned the malefactor about his evil deeds, they were shocked when he laughed in their faces.
  - As the police officers led the malefactor into the courthouse, they tried to block out the sounds of the angry protestors.
  - To get a higher divorcement settlement, Jill described her husband as a cruel malefactor who abused her on a daily basis.
  - The malefactor tried to reform his image by performing good deeds.



* [[https://wordsinasentence.com/maleficent-in-a-sentence/][Maleficent]]

  =harmful or evil in intent or effect=

  - The preacher said that Satan is a maleficent force that urges men to sin.
  - I consider our President to be a maleficent type who derives happiness from harming his political opponents.
  - Curtis warned me not to date Laura because she has a maleficent side to her in how she enjoys harming others.
  - Bob has a maleficent look in his eyes that radiates so much evil that I fear meeting him.



* [[https://wordsinasentence.com/malfeasance-in-a-sentence/][Malfeasance]]

  =the performance of an illegal deed, generally by someone in the public trust=

  - When the election results are tallied, surely the people will have voted out the mayor who is currently being investigated for malfeasance.
  - A handful of police officers were arrested today for malfeasance during drug busts.
  - Because of the company president’s malfeasance, he has been removed from his office.
  - Once the government investigates the drug’s manufacturer’s malfeasance, many people may be charged for the woman’s drug-induced death.
  - The school principal covered his face with his hands and did not respond to the media’s questions about his malfeasance.
  - If the legislator is arrested for the crime, his peers will quickly vote to remove him for malfeasance and for dishonoring his office.
  - I was shocked when my stockbroker was indicted for financial malfeasance.



* [[https://wordsinasentence.com/mandate-in-a-sentence/][Mandate]]

  =permission to do something=

  - The marshal was given a mandate to use all resources to bring in the escaped prisoner.
  - During the hurricane, several rescue groups received a mandate to help evacuate the city.
  - Does the mandate allow police officers to carry their weapons aboard commercial airplanes?
  - When my husband and I are away from home, my teenage daughter has the mandate to supervise the rest of the family.
  - Under the safety mandate, the school principal has the authority to search student lockers for drugs and weapons.
  - As soon as Brent signed the contract, he was given the mandate to join his team on the field.
  - The mandate does not allow police officers to enter your home without a warrant.



* [[https://wordsinasentence.com/mangle-in-a-sentence/][Mangle]]

  =to make unrecognizable through violent acts of cutting, slashing, or crushing=

  - The lion's razor-sharp claws mangle the terrified gazelle as he feeds.
  - After her boyfriend broke up with her, the angry girl used a  pair of scissors to mangle and destroy every stuffed animal he’d ever given her.
  - Sharks mangle their prey so thoroughly that they’re hardly recognizable through the bloody tears and gargantuan bite marks.
  - Head-on collisions often mangle the cars so badly that they resemble crushed soda cans.



* [[https://wordsinasentence.com/manifesto-in-a-sentence/][Manifesto]]

  =a public statement reflecting the philosophy of a person or group=

  - In his manifesto, the presidential candidate described himself as the only person who could make the country great again.
  - The charity’s manifesto explains the organization’s mission.
  - After writing a manifesto about equal rights, the civil rights leader was assassinated.
  - The dictator wrote a manifesto defending his country’s isolation from the rest of the world.



* [[https://wordsinasentence.com/mar-in-a-sentence/][Mar]]

  =to ruin or spoil=

  - You will mar the cake if you keep putting your fingers in the icing.
  - If Bill is not careful, he will mar his project on the way to school.
  - The author’s last book is so poorly written it will probably mar his legacy.
  - Because the musical selections are not engaging, they mar the film’s appeal.



