ruby/M.html



<div id="outline-container-sec-24" class="outline-2">
<h2 id="sec-24"><span class="section-number-2">24</span> <a href="https://wordsinasentence.com/malaise-in-a-sentence/">Malaise</a></h2>
<div class="outline-text-2" id="text-24">
<p>
<code>a feeling of general bodily discomfort, fatigue or unpleasantness</code>
</p>

<ul class="org-ul">
<li>Jason knew he was getting ill because of the malaise he had been experiencing for a few days.
</li>
<li>Since Barbara felt the malaise was interfering with her daily life, she scheduled a doctor’s appointment.
</li>
<li>Many citizens who live near the contaminated lake are complaining of a malaise that keeps them bedridden.
</li>
<li>Even after the physician performed an examination, he was still unable to determine the factor causing his patient’s malaise.
</li>
<li>When our boss announced upcoming salary cuts, many people in our office complained of malaise and job dissatisfaction.
</li>
<li>Weeks before his heart attack, Jim kept mentioning how he was experiencing malaise and not feeling like his normal self.
</li>
<li>On Valentine’s Day, many single women complain of malaise and loneliness.
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-25" class="outline-2">
<h2 id="sec-25"><span class="section-number-2">25</span> <a href="https://wordsinasentence.com/malediction-in-a-sentence/">Malediction</a></h2>
<div class="outline-text-2" id="text-25">
<p>
<code>an evil speech or curse upon someone or something</code>
</p>

<ul class="org-ul">
<li>The witch’s malediction made the young princess fall into a deep sleep.
</li>
<li>Before the warlock was imprisoned, he placed a malediction upon his captor’s families.
</li>
<li>Sometimes my luck is so bad I believe someone has placed a malediction upon me.
</li>
<li>As long as the king is under the wizard’s malediction, he will not recall his own identity.
</li>
<li>The woman tried to kill her cheating husband by chanting a malediction.
</li>
<li>According to the malediction, darkness will reign in the kingdom for the next fifty years.
</li>
<li>Since all the women in my family suffer from depression, it appears we share a malediction.
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-26" class="outline-2">
<h2 id="sec-26"><span class="section-number-2">26</span> <a href="https://wordsinasentence.com/malefactor-in-a-sentence/">Malefactor</a></h2>
<div class="outline-text-2" id="text-26">
<p>
<code>one who does evil</code>
</p>

<ul class="org-ul">
<li>For several years, the detective pursued the malefactor who had brutally killed the two children.
</li>
<li>Hopefully, the hero will fatally injure the malefactor during the gunfight.
</li>
<li>The dictator was a merciless malefactor who tortured his subjects for fun.
</li>
<li>When the police questioned the malefactor about his evil deeds, they were shocked when he laughed in their faces.
</li>
<li>As the police officers led the malefactor into the courthouse, they tried to block out the sounds of the angry protestors.
</li>
<li>To get a higher divorcement settlement, Jill described her husband as a cruel malefactor who abused her on a daily basis.
</li>
<li>The malefactor tried to reform his image by performing good deeds.
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-27" class="outline-2">
<h2 id="sec-27"><span class="section-number-2">27</span> <a href="https://wordsinasentence.com/maleficent-in-a-sentence/">Maleficent</a></h2>
<div class="outline-text-2" id="text-27">
<p>
<code>harmful or evil in intent or effect</code>
</p>

<ul class="org-ul">
<li>The preacher said that Satan is a maleficent force that urges men to sin.
</li>
<li>I consider our President to be a maleficent type who derives happiness from harming his political opponents.
</li>
<li>Curtis warned me not to date Laura because she has a maleficent side to her in how she enjoys harming others.
</li>
<li>Bob has a maleficent look in his eyes that radiates so much evil that I fear meeting him.
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-28" class="outline-2">
<h2 id="sec-28"><span class="section-number-2">28</span> <a href="https://wordsinasentence.com/malfeasance-in-a-sentence/">Malfeasance</a></h2>
<div class="outline-text-2" id="text-28">
<p>
<code>the performance of an illegal deed, generally by someone in the public trust</code>
</p>

<ul class="org-ul">
<li>When the election results are tallied, surely the people will have voted out the mayor who is currently being investigated for malfeasance.
</li>
<li>A handful of police officers were arrested today for malfeasance during drug busts.
</li>
<li>Because of the company president’s malfeasance, he has been removed from his office.
</li>
<li>Once the government investigates the drug’s manufacturer’s malfeasance, many people may be charged for the woman’s drug-induced death.
</li>
<li>The school principal covered his face with his hands and did not respond to the media’s questions about his malfeasance.
</li>
<li>If the legislator is arrested for the crime, his peers will quickly vote to remove him for malfeasance and for dishonoring his office.
</li>
<li>I was shocked when my stockbroker was indicted for financial malfeasance.
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-29" class="outline-2">
<h2 id="sec-29"><span class="section-number-2">29</span> <a href="https://wordsinasentence.com/mandate-in-a-sentence/">Mandate</a></h2>
<div class="outline-text-2" id="text-29">
<p>
<code>permission to do something</code>
</p>

<ul class="org-ul">
<li>The marshal was given a mandate to use all resources to bring in the escaped prisoner.
</li>
<li>During the hurricane, several rescue groups received a mandate to help evacuate the city.
</li>
<li>Does the mandate allow police officers to carry their weapons aboard commercial airplanes?
</li>
<li>When my husband and I are away from home, my teenage daughter has the mandate to supervise the rest of the family.
</li>
<li>Under the safety mandate, the school principal has the authority to search student lockers for drugs and weapons.
</li>
<li>As soon as Brent signed the contract, he was given the mandate to join his team on the field.
</li>
<li>The mandate does not allow police officers to enter your home without a warrant.
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-30" class="outline-2">
<h2 id="sec-30"><span class="section-number-2">30</span> <a href="https://wordsinasentence.com/mangle-in-a-sentence/">Mangle</a></h2>
<div class="outline-text-2" id="text-30">
<p>
<code>to make unrecognizable through violent acts of cutting, slashing, or crushing</code>
</p>

<ul class="org-ul">
<li>The lion's razor-sharp claws mangle the terrified gazelle as he feeds.
</li>
<li>After her boyfriend broke up with her, the angry girl used a  pair of scissors to mangle and destroy every stuffed animal  he’d ever given her.
</li>
<li>Sharks mangle their prey so thoroughly that they’re hardly  recognizable through the bloody tears and gargantuan bite  marks.
</li>
<li>Head-on collisions often mangle the cars so badly that they  resemble crushed soda cans.
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-31" class="outline-2">
<h2 id="sec-31"><span class="section-number-2">31</span> <a href="https://wordsinasentence.com/manifesto-in-a-sentence/">Manifesto</a></h2>
<div class="outline-text-2" id="text-31">
<p>
<code>a public statement reflecting the philosophy of a person or group</code>
</p>

<ul class="org-ul">
<li>In his manifesto, the presidential candidate described himself as the only person who could make the country great again.
</li>
<li>The charity’s manifesto explains the organization’s mission.
</li>
<li>After writing a manifesto about equal rights, the civil rights leader was assassinated.
</li>
<li>The dictator wrote a manifesto defending his country’s isolation from the rest of the world.
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-32" class="outline-2">
<h2 id="sec-32"><span class="section-number-2">32</span> <a href="https://wordsinasentence.com/mar-in-a-sentence/">Mar</a></h2>
<div class="outline-text-2" id="text-32">
<p>
<code>to ruin or spoil</code>
</p>

<ul class="org-ul">
<li>You will mar the cake if you keep putting your fingers in the icing.
</li>
<li>If Bill is not careful, he will mar his project on the way to school.
</li>
<li>The author’s last book is so poorly written it will probably mar his legacy.
</li>
<li>Because the musical selections are not engaging, they mar the film’s appeal.
</li>
</ul>
</div>
</div>
