ruby/M.org
* [[https://wordsinasentence.com/marauding-in-a-sentence/][Marauding]]

  =moving from one location to another in order to commit crimes against society=

  - The marauding thieves never stay more than a few nights in a city.
  - Because the marauding scam artists move around a great deal, it is difficult for the police to track them.
  - The marauding check forgers went from nursing home to nursing home preying on senior citizens.
  - As the marauding soldiers moved about the country, they looted one village after another.


* [[https://wordsinasentence.com/martyr-in-a-sentence/][Martyr]]

  =one who surrenders something of tremendous value for a cause=

  - The gay man became a martyr when he lost his job after refusing to hide his sexual preference.
  - Since the quarterback did not want his entire team to suffer for the loss, he acted as a martyr and accepted full blame for the defeat.
  - Joan became a martyr after she lost her life in the fight again religious persecution.
  - When Bill was murdered after standing up to corrupt police officers, the people in his town viewed him as a martyr.
  - The soldier became a martyr when he threw himself on the live grenade to save his squad.
  - According to the Christian religion, Jesus is a martyr who gave his life so everyone could go to heaven.
  - The woman was viewed as a martyr after being arrested for refusing to deny her religion.



* [[https://wordsinasentence.com/marvel-in-a-sentence/][Marvel]]

  =something or someone that triggers amazement=

  - Many scientists view the three-year-old boy with the extremely high IQ as a marvel.
  - When the tallest building in the world was constructed, it was referred to as an architectural marvel.
  - My teacher praised my project and called it a marvel of creativity.
  - Because Ellen’s sculpture was a marvel to look upon, it easily won first place in the art contest.




* [[https://wordsinasentence.com/mast-in-a-sentence/][Mast]]

  =a tall post attached to a ship that holds sails=

  - The mast had a sail attached and was used to guide the boat.
  - *Flapping in the wind*, the sails on the mast helped direct the boat to its destination.
  - One of the crew member’s was tied to the ships mast and he remained on the pole until it docked.
  - Sails were raised on the mast, inching up and up the pole until they reached the boat’s peak.



* [[https://wordsinasentence.com/masticate-in-a-sentence/][Masticate]]

  =to chomp with teeth; chew=

  - My mother told me to never talk while I masticate my food.
  - Because Daniel did not masticate his food well, he almost choked on a piece of chicken.
  - It was gross watching the old man masticate his tobacco and then spit it out on the sidewalk.
  - If we do not find my grandmother’s artificial teeth, she will not be able to masticate her sandwich.



* [[https://wordsinasentence.com/materialize-in-a-sentence/][Materialize]]

  =to become real or visible=

  - If you want to make your dreams materialize, you must take steps to make them real.
  - Rub the lamp, and the genie will materialize.
  - Because Ken can’t raise enough funds, his vision of owning a restaurant may never materialize.
  - A donation to the scholarship fund will help a person’s college dream materialize.



* [[https://wordsinasentence.com/matriculate-in-a-sentence/][Matriculate]]

  =to become a student at a school, especially a college or university=

  - After high school, I will matriculate at a local community college.
  - Only the best and the brightest can matriculate at Ivy League universities.
  - Rather than matriculate right after graduation and incur debt, James would prefer to enlist in the military for two years so he can save money for school.
  - Everyone who chooses to matriculate at Smith-Jones University will receive a free laptop computer.
  - Anyone who can pay the tuition fees is allowed to matriculate at an online school that has not been endorsed by an academic board.
  - Although Sarah did matriculate at Harvard for one year, she did not graduate from the famed university.
  - Jason has received a full scholarship offer to matriculate at one of the top colleges in the country.



* [[https://wordsinasentence.com/matte-in-a-sentence/][Matte]]

  =describing a color that is dull and has no shine=

  - This brown color is extremely matte, dull and lifeless but supposedly a good color for this piece of furniture, according to my mother.
  - Some women prefer to wear matte makeup that is duller and a lot less glossy, though it’s really just a personal preference.
  - My father is a rather sullen individual, so when he got to choose the color of our living room walls he chose a matte *beige* instead of a shinier color.
  - Matte colors are rarely used for cars, because most people prefer to have shiny and reflective colors on their vehicle instead of dull ones.



* [[https://wordsinasentence.com/maul-in-a-sentence/][Maul]]

  =to wound someone by scratching or tearing them, often used in reference to animals=

  - I would never go near a bear even in captivity, for fear that it would maul me with its huge teeth and claws.
  - There is a chance that any animals with claws and teeth could maul you, but scratches and cuts are the least of your worries with a carnivore.
  - The lion chose to maul the man we received at the hospital today, inflicting all sorts of *gashes* and cuts on him that we had to stitch up.
  - Even though we usually use the word maul in reference to animals, a human could maul another person with a knife or a dagger.



* [[https://wordsinasentence.com/mawkish-in-a-sentence/][Mawkish]]

  =being overly sentimental to the point it comes across as fake or silly=

  - The star’s mawkish poem at her mentor’s funeral was so insincere that most of the guests rolled their eyes.
  - Since I knew how much my mother loved my father, I knew she was not being mawkish when she sang his favorite song during his wake.
  - My unromantic husband would never do anything as mawkish as writing me a poem.
  - To the experienced detective, the victim’s wife appeared mawkish as though she was putting on an act.
  - I told Carl his mawkish plan to win Trisha back was so excessive she would probably laugh in his face.
  - When April realized her husband was planning a divorce, she put together a mawkish photo album to remind him of happier days.
  - Although Larry hated to come across as mawkish, he never hesitated to share pictures of his family with his friends.



