ruby/M.html



<div id="outline-container-sec-33" class="outline-2">
<h2 id="sec-33"><span class="section-number-2">33</span> <a href="https://wordsinasentence.com/marauding-in-a-sentence/">Marauding</a></h2>
<div class="outline-text-2" id="text-33">
<p>
<code>moving from one location to another in order to commit crimes against society</code>
</p>

<ul class="org-ul">
<li>The marauding thieves never stay more than a few nights in a city.
</li>
<li>Because the marauding scam artists move around a great deal, it is difficult for the police to track them.
</li>
<li>The marauding check forgers went from nursing home to nursing home preying on senior citizens.
</li>
<li>As the marauding soldiers moved about the country, they looted one village after another.
</li>
</ul>
</div>
</div>


<div id="outline-container-sec-34" class="outline-2">
<h2 id="sec-34"><span class="section-number-2">34</span> <a href="https://wordsinasentence.com/martyr-in-a-sentence/">Martyr</a></h2>
<div class="outline-text-2" id="text-34">
<p>
<code>one who surrenders something of tremendous value for a cause</code>
</p>

<ul class="org-ul">
<li>The gay man became a martyr when he lost his job after refusing to hide his sexual preference.
</li>
<li>Since the quarterback did not want his entire team to suffer for the loss, he acted as a martyr and accepted full blame for the defeat.
</li>
<li>Joan became a martyr after she lost her life in the fight again religious persecution.
</li>
<li>When Bill was murdered after standing up to corrupt police officers, the people in his town viewed him as a martyr.
</li>
<li>The soldier became a martyr when he threw himself on the live grenade to save his squad.
</li>
<li>According to the Christian religion, Jesus is a martyr who gave his life so everyone could go to heaven.
</li>
<li>The woman was viewed as a martyr after being arrested for refusing to deny her religion.
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-35" class="outline-2">
<h2 id="sec-35"><span class="section-number-2">35</span> <a href="https://wordsinasentence.com/marvel-in-a-sentence/">Marvel</a></h2>
<div class="outline-text-2" id="text-35">
<p>
<code>something or someone that triggers amazement</code>
</p>

<ul class="org-ul">
<li>Many scientists view the three-year-old boy with the extremely high IQ as a marvel.
</li>
<li>When the tallest building in the world was constructed, it was referred to as an architectural marvel.
</li>
<li>My teacher praised my project and called it a marvel of creativity.
</li>
<li>Because Ellen’s sculpture was a marvel to look upon, it easily won first place in the art contest.
</li>
</ul>
</div>
</div>




<div id="outline-container-sec-36" class="outline-2">
<h2 id="sec-36"><span class="section-number-2">36</span> <a href="https://wordsinasentence.com/mast-in-a-sentence/">Mast</a></h2>
<div class="outline-text-2" id="text-36">
<p>
<code>a tall post attached to a ship that holds sails</code>
</p>

<ul class="org-ul">
<li>The mast had a sail attached and was used to guide the boat.
</li>
<li>Flapping in the wind, the sails on the mast helped direct the boat to its destination.
</li>
<li>One of the crew member’s was tied to the ships mast and he remained on the pole until it docked.
</li>
<li>Sails were raised on the mast, inching up and up the pole until they reached the boat’s peak.
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-37" class="outline-2">
<h2 id="sec-37"><span class="section-number-2">37</span> <a href="https://wordsinasentence.com/masticate-in-a-sentence/">Masticate</a></h2>
<div class="outline-text-2" id="text-37">
<p>
<code>to chomp with teeth; chew</code>
</p>

<ul class="org-ul">
<li>My mother told me to never talk while I masticate my food.
</li>
<li>Because Daniel did not masticate his food well, he almost choked on a piece of chicken.
</li>
<li>It was gross watching the old man masticate his tobacco and then spit it out on the sidewalk.
</li>
<li>If we do not find my grandmother’s artificial teeth, she will not be able to masticate her sandwich.
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-38" class="outline-2">
<h2 id="sec-38"><span class="section-number-2">38</span> <a href="https://wordsinasentence.com/materialize-in-a-sentence/">Materialize</a></h2>
<div class="outline-text-2" id="text-38">
<p>
<code>to become real or visible</code>
</p>

<ul class="org-ul">
<li>If you want to make your dreams materialize, you must take steps to make them real.
</li>
<li>Rub the lamp, and the genie will materialize.
</li>
<li>Because Ken can’t raise enough funds, his vision of owning a restaurant may never materialize.
</li>
<li>A donation to the scholarship fund will help a person’s college dream materialize.
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-39" class="outline-2">
<h2 id="sec-39"><span class="section-number-2">39</span> <a href="https://wordsinasentence.com/matriculate-in-a-sentence/">Matriculate</a></h2>
<div class="outline-text-2" id="text-39">
<p>
<code>to become a student at a school, especially a college or university</code>
</p>

<ul class="org-ul">
<li>After high school, I will matriculate at a local community college.
</li>
<li>Only the best and the brightest can matriculate at Ivy League universities.
</li>
<li>Rather than matriculate right after graduation and incur debt, James would prefer to enlist in the military for two years so he can save money for school.
</li>
<li>Everyone who chooses to matriculate at Smith-Jones University will receive a free laptop computer.
</li>
<li>Anyone who can pay the tuition fees is allowed to matriculate at an online school that has not been endorsed by an academic board.
</li>
<li>Although Sarah did matriculate at Harvard for one year, she did not graduate from the famed university.
</li>
<li>Jason has received a full scholarship offer to matriculate at one of the top colleges in the country.
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-40" class="outline-2">
<h2 id="sec-40"><span class="section-number-2">40</span> <a href="https://wordsinasentence.com/matte-in-a-sentence/">Matte</a></h2>
<div class="outline-text-2" id="text-40">
<p>
<code>describing a color that is dull and has no shine</code>
</p>

<ul class="org-ul">
<li>This brown color is extremely matte, dull and lifeless but supposedly a good color for this piece of furniture, according to my mother.
</li>
<li>Some women prefer to wear matte makeup that is duller and a lot less glossy, though it’s really just a personal preference.
</li>
<li>My father is a rather sullen individual, so when he got to choose the color of our living room walls he chose a matte beige instead of a shinier color.
</li>
<li>Matte colors are rarely used for cars, because most people prefer to have shiny and reflective colors on their vehicle instead of dull ones.
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-41" class="outline-2">
<h2 id="sec-41"><span class="section-number-2">41</span> <a href="https://wordsinasentence.com/maul-in-a-sentence/">Maul</a></h2>
<div class="outline-text-2" id="text-41">
<p>
<code>to wound someone by scratching or tearing them, often used in reference to animals</code>
</p>

<ul class="org-ul">
<li>I would never go near a bear even in captivity, for fear that it would maul me with its huge teeth and claws.
</li>
<li>There is a chance that any animals with claws and teeth could maul you, but scratches and cuts are the least of your worries with a carnivore.
</li>
<li>The lion chose to maul the man we received at the hospital today, inflicting all sorts of gashes and cuts on him that we had to stitch up.
</li>
<li>Even though we usually use the word maul in reference to animals, a human could maul another person with a knife or a dagger.
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-42" class="outline-2">
<h2 id="sec-42"><span class="section-number-2">42</span> <a href="https://wordsinasentence.com/mawkish-in-a-sentence/">Mawkish</a></h2>
<div class="outline-text-2" id="text-42">
<p>
<code>being overly sentimental to the point it comes across as fake or silly</code>
</p>

<ul class="org-ul">
<li>The star’s mawkish poem at her mentor’s funeral was so insincere that most of the guests rolled their eyes.
</li>
<li>Since I knew how much my mother loved my father, I knew she was not being mawkish when she sang his favorite song during his wake.
</li>
<li>My unromantic husband would never do anything as mawkish as writing me a poem.
</li>
<li>To the experienced detective, the victim’s wife appeared mawkish as though she was putting on an act.
</li>
<li>I told Carl his mawkish plan to win Trisha back was so excessive she would probably laugh in his face.
</li>
<li>When April realized her husband was planning a divorce, she put together a mawkish photo album to remind him of happier days.
</li>
<li>Although Larry hated to come across as mawkish, he never hesitated to share pictures of his family with his friends.
</li>
</ul>
</div>
</div>
