ruby/M.org
* [[https://wordsinasentence.com/meander-in-a-sentence/][Meander]]

  =to move slowly without any real purpose=

  - The confused old man will sometimes come into the store and meander for hours without making a purchase.
  - During my vacation, I have no plans other than to meander through the mountains for days.
  - Jason let his mind meander and by the time the workday was over, he had made very little progress on his accounts.
  - Unless I *nag* my daughter about completing her chores, she will meander and never get anything done.
  - Some Alzheimer’s patients are known to meander aimlessly about the hospital.
  - On my lunch break, I often meander through the park while eating a sandwich.
  - Without a grocery list, my grandmother will meander up and down the store aisles for hours.



* [[https://wordsinasentence.com/measly-in-a-sentence/][Measly]]

  =an extremely, almost laughably small amount=

  - Briana hoped her mother would pay her well for babysitting her brothers but she only got a measly $5.
  - Miranda was beyond excited when she won the Halloween costume contest but extremely disappointed by her measly prize of a free ice cream cone.
  - The soccer team was starving because all they had to eat was a measly slice of pizza each.
  - After paying several hundred dollars for dinner at a famous French restaurant, the businessman was disappointed when he received a measly piece of chicken and mashed potatoes.



* [[https://wordsinasentence.com/meek-in-a-sentence/][Meek]]

  =restrained; unwilling to speak up=

  - Although the meek girl knew the answer to the teacher’s question, she was too nervous to raise her hand.
  - The trainer suggested tips to help me transform my aggressive dog into a meek *pooch*.
  - Because the doctor believed the patient was out of control, he gave him an injection to make him meek.
  - Tim has never gotten a promotion at work because he is too meek to express his opinions.



* [[https://wordsinasentence.com/meld-in-a-sentence/][Meld]]

  =to blend or merge things together=

  - Singing in harmony, the musicians were able to meld their voices.
  - The team members had to find a way to meld their ideas into one solid concept.
  - The author tried to meld both characters into one strong antagonist.
  - As a producer, his ability to meld sounds together was unmatched.



* [[https://wordsinasentence.com/mellifluous-in-a-sentence/][Mellifluous]]

  =having a smooth, flowing sound=

  - The actor has a mellifluous voice that could lull anyone into a deep sleep.
  - When the snakes heard the mellifluous sounds coming from the flute, they began to crawl back into the basket.
  - The singer with the mellifluous voice will win the talent contest.
  - At night the stream outside our cabin makes a mellifluous sound that is very peaceful to our ears.
  - After the judge gave Marie a standing ovation, he described her voice as mellifluous and enchanting.
  - While Curtis enjoys the mellifluous tone of rap music, John considers that type of music to be nothing more than unpleasant noise.
  - The mellifluous music never fails to put my newborn baby to sleep.



* [[https://wordsinasentence.com/menace-in-a-sentence/][Menace]]

  =an individual or situation that causes problems=

  - My neighbor’s dog is a menace who seems to enjoy going potty on my porch.
  - In the summer, ants can be a real menace in the kitchen.
  - Identify theft is a huge menace to society.
  - Once the baby learned to walk, he became a menace who pulled down every item he could reach.



* [[https://wordsinasentence.com/mendacious-in-a-sentence/][Mendacious]]

  =lying; not telling the truth=

  - Chuck is mendacious about his vegetarianism because he eats chicken.
  - Instead of giving me another mendacious story, just be honest for once.
  - Mendacious people hide the truth.
  - My wife is mendacious for dating another man behind my back.
  - Please give me a promise that you can keep—not a mendacious promise.
  - How mendacious of Joan to habitually *call in sick from work* when she's feeling fine!
  - A product claiming to help you get ripped abs in a few hours is mendacious advertising.



* [[https://wordsinasentence.com/mendacity-in-a-sentence/][Mendacity]]

  =lack of honesty=

  - Since honesty is very important to me, I was deeply offended by my ex-husband’s mendacity.
  - You can always tell a con man by his mendacity and desire to trick you out of your money.
  - Because Melinda was known for her mendacity, she was the first suspect the police interviewed.
  - Jim cannot find employment at a bank because of his mendacity.
  - As a politician, Alan tries very hard to hide his mendacity from the voters.
  - Edward’s mendacity makes him a big winner at the poker tables.
  - When the lawyer accused the priest of mendacity, he shocked everyone in the courtroom.



* [[https://wordsinasentence.com/mendicant-in-a-sentence/][Mendicant]]

  =an individual who begs for a living=

  - The mendicant hoped pedestrians would drop money in his bucket.
  - Rather than search for a job, Jimmy chooses to live as a mendicant who panhandles his way through each day.
  - The alcoholic mendicant begged for money to buy booze.
  - As part of my psychology thesis, I dressed like a mendicant to see how people would treat me when I looked like a beggar.



* [[https://wordsinasentence.com/mesmerized-in-a-sentence/][Mesmerized]]

  =captivated by something or someone=

  - Because Jennifer was mesmerized by the author’s writing style, she purchased all of his books.
  - The bright lights of the city mesmerized the girl from the small town.
  - With its exciting plot and lovable characters, the film mesmerized children of all ages.
  - The media sought to keep the country mesmerized by reporting on the hottest topics of the day.
  - When the orchestra started playing, I was immediately mesmerized by the lovely tune.
  - Jim knew it was time to get married when he found a woman who completely mesmerized him.
  - During the show, the talented dancer mesmerized Ginger with his fancy footwork.



* [[https://wordsinasentence.com/mete-in-a-sentence/][Mete]]

  =to give out or distribute=

  - After being caught stealing, the boy waited for his father to mete out his punishment.
  - The judge will mete out very harsh sentences when he’s in an unpleasant mood.
  - Since more guests arrived than we expected, we had to mete out small portions of food.
  - The budget cuts decreased the amount each school had to mete out for supplies.



