ruby/M.html



<div id="outline-container-sec-43" class="outline-2">
<h2 id="sec-43"><span class="section-number-2">43</span> <a href="https://wordsinasentence.com/meander-in-a-sentence/">Meander</a></h2>
<div class="outline-text-2" id="text-43">
<p>
<code>to move slowly without any real purpose</code>
</p>

<ul class="org-ul">
<li>The confused old man will sometimes come into the store and meander for hours without making a purchase.
</li>
<li>During my vacation, I have no plans other than to meander through the mountains for days.
</li>
<li>Jason let his mind meander and by the time the workday was over, he had made very little progress on his accounts.
</li>
<li>Unless I nag my daughter about completing her chores, she will meander and never get anything done.
</li>
<li>Some Alzheimer’s patients are known to meander aimlessly about the hospital.
</li>
<li>On my lunch break, I often meander through the park while eating a sandwich.
</li>
<li>Without a grocery list, my grandmother will meander up and down the store aisles for hours.
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-44" class="outline-2">
<h2 id="sec-44"><span class="section-number-2">44</span> <a href="https://wordsinasentence.com/measly-in-a-sentence/">Measly</a></h2>
<div class="outline-text-2" id="text-44">
<p>
<code>an extremely, almost laughably small amount</code>
</p>

<ul class="org-ul">
<li>Briana hoped her mother would pay her well for babysitting her brothers but she only got a measly $5.
</li>
<li>Miranda was beyond excited when she won the Halloween costume contest but extremely disappointed by her measly prize of a free ice cream cone.
</li>
<li>The soccer team was starving because all they had to eat was a measly slice of pizza each.
</li>
<li>After paying several hundred dollars for dinner at a famous French restaurant, the businessman was disappointed when he received a measly piece of chicken and mashed potatoes.
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-45" class="outline-2">
<h2 id="sec-45"><span class="section-number-2">45</span> <a href="https://wordsinasentence.com/meek-in-a-sentence/">Meek</a></h2>
<div class="outline-text-2" id="text-45">
<p>
<code>restrained; unwilling to speak up</code>
</p>

<ul class="org-ul">
<li>Although the meek girl knew the answer to the teacher’s question, she was too nervous to raise her hand.
</li>
<li>The trainer suggested tips to help me transform my aggressive dog into a meek pooch.
</li>
<li>Because the doctor believed the patient was out of control, he gave him an injection to make him meek.
</li>
<li>Tim has never gotten a promotion at work because he is too meek to express his opinions.
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-46" class="outline-2">
<h2 id="sec-46"><span class="section-number-2">46</span> <a href="https://wordsinasentence.com/meld-in-a-sentence/">Meld</a></h2>
<div class="outline-text-2" id="text-46">
<p>
<code>to blend or merge things together</code>
</p>

<ul class="org-ul">
<li>Singing in harmony, the musicians were able to meld their voices.
</li>
<li>The team members had to find a way to meld their ideas into one solid concept.
</li>
<li>The author tried to meld both characters into one strong antagonist.
</li>
<li>As a producer, his ability to meld sounds together was unmatched.
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-47" class="outline-2">
<h2 id="sec-47"><span class="section-number-2">47</span> <a href="https://wordsinasentence.com/mellifluous-in-a-sentence/">Mellifluous</a></h2>
<div class="outline-text-2" id="text-47">
<p>
<code>having a smooth, flowing sound</code>
</p>

<ul class="org-ul">
<li>The actor has a mellifluous voice that could lull anyone into a deep sleep.
</li>
<li>When the snakes heard the mellifluous sounds coming from the flute, they began to crawl back into the basket.
</li>
<li>The singer with the mellifluous voice will win the talent contest.
</li>
<li>At night the stream outside our cabin makes a mellifluous sound that is very peaceful to our ears.
</li>
<li>After the judge gave Marie a standing ovation, he described her voice as mellifluous and enchanting.
</li>
<li>While Curtis enjoys the mellifluous tone of rap music, John considers that type of music to be nothing more than unpleasant noise.
</li>
<li>The mellifluous music never fails to put my newborn baby to sleep.
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-48" class="outline-2">
<h2 id="sec-48"><span class="section-number-2">48</span> <a href="https://wordsinasentence.com/menace-in-a-sentence/">Menace</a></h2>
<div class="outline-text-2" id="text-48">
<p>
<code>an individual or situation that causes problems</code>
</p>

<ul class="org-ul">
<li>My neighbor’s dog is a menace who seems to enjoy going potty on my porch.
</li>
<li>In the summer, ants can be a real menace in the kitchen.
</li>
<li>Identify theft is a huge menace to society.
</li>
<li>Once the baby learned to walk, he became a menace who pulled down every item he could reach.
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-49" class="outline-2">
<h2 id="sec-49"><span class="section-number-2">49</span> <a href="https://wordsinasentence.com/mendacious-in-a-sentence/">Mendacious</a></h2>
<div class="outline-text-2" id="text-49">
<p>
<code>lying; not telling the truth</code>
</p>

<ul class="org-ul">
<li>Chuck is mendacious about his vegetarianism because he eats chicken.
</li>
<li>Instead of giving me another mendacious story, just be honest for once.
</li>
<li>Mendacious people hide the truth.
</li>
<li>My wife is mendacious for dating another man behind my back.
</li>
<li>Please give me a promise that you can keep—not a mendacious promise.
</li>
<li>How mendacious of Joan to habitually call in sick from work when she's feeling fine!
</li>
<li>A product claiming to help you get ripped abs in a few hours is mendacious advertising.
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-50" class="outline-2">
<h2 id="sec-50"><span class="section-number-2">50</span> <a href="https://wordsinasentence.com/mendacity-in-a-sentence/">Mendacity</a></h2>
<div class="outline-text-2" id="text-50">
<p>
<code>lack of honesty</code>
</p>

<ul class="org-ul">
<li>Since honesty is very important to me, I was deeply offended by my ex-husband’s mendacity.
</li>
<li>You can always tell a con man by his mendacity and desire to trick you out of your money.
</li>
<li>Because Melinda was known for her mendacity, she was the first suspect the police interviewed.
</li>
<li>Jim cannot find employment at a bank because of his mendacity.
</li>
<li>As a politician, Alan tries very hard to hide his mendacity from the voters.
</li>
<li>Edward’s mendacity makes him a big winner at the poker tables.
</li>
<li>When the lawyer accused the priest of mendacity, he shocked everyone in the courtroom.
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-51" class="outline-2">
<h2 id="sec-51"><span class="section-number-2">51</span> <a href="https://wordsinasentence.com/mendicant-in-a-sentence/">Mendicant</a></h2>
<div class="outline-text-2" id="text-51">
<p>
<code>an individual who begs for a living</code>
</p>

<ul class="org-ul">
<li>The mendicant hoped pedestrians would drop money in his bucket.
</li>
<li>Rather than search for a job, Jimmy chooses to live as a mendicant who panhandles his way through each day.
</li>
<li>The alcoholic mendicant begged for money to buy booze.
</li>
<li>As part of my psychology thesis, I dressed like a mendicant to see how people would treat me when I looked like a beggar.
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-52" class="outline-2">
<h2 id="sec-52"><span class="section-number-2">52</span> <a href="https://wordsinasentence.com/mesmerized-in-a-sentence/">Mesmerized</a></h2>
<div class="outline-text-2" id="text-52">
<p>
<code>captivated by something or someone</code>
</p>

<ul class="org-ul">
<li>Because Jennifer was mesmerized by the author’s writing style, she purchased all of his books.
</li>
<li>The bright lights of the city mesmerized the girl from the small town.
</li>
<li>With its exciting plot and lovable characters, the film mesmerized children of all ages.
</li>
<li>The media sought to keep the country mesmerized by reporting on the hottest topics of the day.
</li>
<li>When the orchestra started playing, I was immediately mesmerized by the lovely tune.
</li>
<li>Jim knew it was time to get married when he found a woman who completely mesmerized him.
</li>
<li>During the show, the talented dancer mesmerized Ginger with his fancy footwork.
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-53" class="outline-2">
<h2 id="sec-53"><span class="section-number-2">53</span> <a href="https://wordsinasentence.com/mete-in-a-sentence/">Mete</a></h2>
<div class="outline-text-2" id="text-53">
<p>
<code>to give out or distribute</code>
</p>

<ul class="org-ul">
<li>After being caught stealing, the boy waited for his father to mete out his punishment.
</li>
<li>The judge will mete out very harsh sentences when he’s in an unpleasant mood.
</li>
<li>Since more guests arrived than we expected, we had to mete out small portions of food.
</li>
<li>The budget cuts decreased the amount each school had to mete out for supplies.
</li>
</ul>
</div>
</div>
