ruby/M.org
* [[https://wordsinasentence.com/mettle-in-a-sentence/][Mettle]]

  =strength of spirit; the ability to continue despite difficulties=

  - Of all the young men in the village, Caldor was the only one with enough mettle to face the dragon in its *lair*.
  - To prove his mettle and show that he was daring enough to join the club, Timmy had to spend an hour alone in the haunted house on the hill.
  - Even though all members of the navy have high levels of *fortitude* and courage, candidates for Navy Seal training must exhibit far more mettle than average.
  - Because Aaron has *carried the team* for most of the season, his injury will test the mettle of his teammates to see if they can win any games without him.
  - Maxwell joined several boards of directors in order to prove his mettle as a community leader.
  - You should be congratulated for showing your mettle and coming through such a difficult situation with your head high.
  - When the prototype of the new spaceship was finished, the team tested its mettle by simulating a trip to Mars.



* [[https://wordsinasentence.com/mien-in-a-sentence/][Mien]]

  =manner or conduct especially indicating one's mood or character=

  - When I saw his *downcast* face and gloomy mien, I knew he hadn’t gotten the promotion.
  - Although Mary Jane usually exhibits a mild-mannered mien, she can get pretty fierce when there’s a sale at her favorite store.
  - Reginald has a naturally dignified mien that makes him the perfect actor to play the role of the butler in this movie.
  - The toddler had such a joyful mien that he brought smiles to the faces of everyone he came in contact with.
  - After the inspiring Easter sunrise service, all the parishioners walked out of the church with a more reverent mien.
  - When the doorbell rang at midnight, Brian’s mien was *guarded* =谨慎的= as he peered through the peephole in the front door.
  - Andrew displays a *brash* mien that tends to offend people who don’t know what a nice guy he really is.



* [[https://wordsinasentence.com/miffed-in-a-sentence/][Miffed]]

  =to be irritated and upset=

  - When the paperboy continued to throw the newspaper into the puddle of water, the owner was miffed at the thoughtless boy.
  - As the inconsiderate teenage boy continued to smack his gum with his mouth wide open, the ladies sitting next to him were miffed with the distracting noise.
  - Sarah was miffed by her boyfriend’s lie about being gravely sick as soon as she found him at the movie theater with his friends.
  - The children were always miffed when they would be forced by their parents to play with bossy Janice.



* [[https://wordsinasentence.com/militia-in-a-sentence/][Militia]]

  =a military force of trained and organized civilians who may be called to duty=

  - The militia was assigned to assist the police until the National Guard troops arrived.
  - To rid their country of a dictator, a group of rebels organized a militia to overthrow the tyrant.
  - The governor has called upon the militia to assist families relocating during the hurricane evacuation.
  - In the small town, the militia is often called in to help search for escaped prisoners.



* [[https://wordsinasentence.com/mingle-in-a-sentence/][Mingle]]

  =To mix or combine (people or objects)=

  - The spies decided to mingle in with the crowd and see if they could find the killer.
  - Mixing the *stir-fry*, the chef decided to mix in some chicken with the vegetables.
  - Royals never mingle with the common folk but prefer to stick to their class.
  - John was able to mingle with the other students and ended up feeling right at home at college.



* [[https://wordsinasentence.com/mirth-in-a-sentence/][Mirth]]

  =amusement and joy=

  - It was obvious from Jacob’s mirth he found the movie to be quite funny.
  - When my stern father gives out consequences for bad behavior, he never displays any mirth.
  - The teacher tried to hide her mirth when she learned her worst student had been suspended for seven days.
  - With a twinkle of mirth in his eyes, Santa Claus winked at the small child before going back up the chimney.




* [[https://wordsinasentence.com/miscreant-in-a-sentence/][Miscreant]]

  =an individual who has misbehaved=

  - The principal took the miscreant out of my classroom and placed him in the in-school suspension room.
  - Sometimes when Jim acts like a miscreant, his wife kicks him out of the house.
  - For the computer savvy miscreant, it is a great age in which to be a hacker.
  - How long is it going to take the police to capture the miscreant who keeps knocking down mailboxes in our neighborhood?
  - Everyone is shocked a proper lady like April is dating a miscreant like James.
  - Because James is a miscreant with a *felony* record for murder, he cannot become a police officer.
  - The church installed cameras outside in hopes of catching the miscreant who was vandalizing the building.



* [[https://wordsinasentence.com/misgiving-in-a-sentence/][Misgiving]]

  =a feeling of doubt=

  - When I learned my daughter’s boyfriend had just been released from prison, my misgiving about him became stronger.
  - James overlooked his misgiving about the new job because he really needed to pay his rent.
  - Despite the actor’s misgiving about the film, he accepted the role and won an Academy Award for his efforts.
  - Helen had a terrible misgiving she might have rushed into her relationship with Mark too soon.



* [[https://wordsinasentence.com/mistrial-in-a-sentence/][Mistrial]]

  =a trial that ends through an error in the proceedings=

  - Bill Cosby’s rape hearing ended in a mistrial since the jurors were deadlocked and couldn’t come to a decision.
  - The judge declared a mistrial, ruling that the entire *proceeding* =诉讼= invalid after a juror admitted to knowing the defendant.
  - Even though they knew that they could try the killer again, the mistrial was a disappointment to the district attorney and his staff.
  - A mistrial was ruled when the judge felt that a problem with a witness would make it impossible for a fair decision to be reached.

* [[https://wordsinasentence.com/moan-in-a-sentence/][Moan]]

  =A long low sound used to express physical or mental suffering=

  - Letting out a painful moan, the trapped motorist hoped someone would hear his cry.
  - Laying all alone in his den, the lonely lion let out a deep moan.
  - The injured player continued to moan as he gripped his hurt leg.
  - Following the sound of the groaning animal, the vet was able to find the source of the moan and help the dog get well.



