ruby/M.html



<div id="outline-container-sec-54" class="outline-2">
<h2 id="sec-54"><span class="section-number-2">54</span> <a href="https://wordsinasentence.com/mettle-in-a-sentence/">Mettle</a></h2>
<div class="outline-text-2" id="text-54">
<p>
<code>strength of spirit; the ability to continue despite difficulties</code>
</p>

<ul class="org-ul">
<li>Of all the young men in the village, Caldor was the only one with enough mettle to face the dragon in its lair.
</li>
<li>To prove his mettle and show that he was daring enough to join the club, Timmy had to spend an hour alone in the haunted house on the hill.
</li>
<li>Even though all members of the navy have high levels of fortitude and courage, candidates for Navy Seal training must exhibit far more mettle than average.
</li>
<li>Because Aaron has carried the team for most of the season, his injury will test the mettle of his teammates to see if they can win any games without him.
</li>
<li>Maxwell joined several boards of directors in order to prove his mettle as a community leader.
</li>
<li>You should be congratulated for showing your mettle and coming through such a difficult situation with your head high.
</li>
<li>When the prototype of the new spaceship was finished, the team tested its mettle by simulating a trip to Mars.
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-55" class="outline-2">
<h2 id="sec-55"><span class="section-number-2">55</span> <a href="https://wordsinasentence.com/mien-in-a-sentence/">Mien</a></h2>
<div class="outline-text-2" id="text-55">
<p>
<code>manner or conduct especially indicating one's mood or character</code>
</p>

<ul class="org-ul">
<li>When I saw his downcast face and gloomy mien, I knew he hadn’t gotten the promotion.
</li>
<li>Although Mary Jane usually exhibits a mild-mannered mien, she can get pretty fierce when there’s a sale at her favorite store.
</li>
<li>Reginald has a naturally dignified mien that makes him the perfect actor to play the role of the butler in this movie.
</li>
<li>The toddler had such a joyful mien that he brought smiles to the faces of everyone he came in contact with.
</li>
<li>After the inspiring Easter sunrise service, all the parishioners walked out of the church with a more reverent mien.
</li>
<li>When the doorbell rang at midnight, Brian’s mien was guarded as he peered through the peephole in the front door.
</li>
<li>Andrew displays a brash mien that tends to offend people who don’t know what a nice guy he really is.
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-56" class="outline-2">
<h2 id="sec-56"><span class="section-number-2">56</span> <a href="https://wordsinasentence.com/miffed-in-a-sentence/">Miffed</a></h2>
<div class="outline-text-2" id="text-56">
<p>
<code>to be irritated and upset</code>
</p>

<ul class="org-ul">
<li>When the paperboy continued to throw the newspaper into the puddle of water, the owner was miffed at the thoughtless boy.
</li>
<li>As the inconsiderate teenage boy continued to smack his gum with his mouth wide open, the ladies sitting next to him were miffed with the distracting noise.
</li>
<li>Sarah was miffed by her boyfriend’s lie about being gravely sick as soon as she found him at the movie theater with his friends.
</li>
<li>The children were always miffed when they would be forced by their parents to play with bossy Janice.
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-57" class="outline-2">
<h2 id="sec-57"><span class="section-number-2">57</span> <a href="https://wordsinasentence.com/militia-in-a-sentence/">Militia</a></h2>
<div class="outline-text-2" id="text-57">
<p>
<code>a military force of trained and organized civilians who may be called to duty</code>
</p>

<ul class="org-ul">
<li>The militia was assigned to assist the police until the National Guard troops arrived.
</li>
<li>To rid their country of a dictator, a group of rebels organized a militia to overthrow the tyrant.
</li>
<li>The governor has called upon the militia to assist families relocating during the hurricane evacuation.
</li>
<li>In the small town, the militia is often called in to help search for escaped prisoners.
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-58" class="outline-2">
<h2 id="sec-58"><span class="section-number-2">58</span> <a href="https://wordsinasentence.com/mingle-in-a-sentence/">Mingle</a></h2>
<div class="outline-text-2" id="text-58">
<p>
<code>To mix or combine (people or objects)</code>
</p>

<ul class="org-ul">
<li>The spies decided to mingle in with the crowd and see if they could find the killer.
</li>
<li>Mixing the stir-fry, the chef decided to mix in some chicken with the vegetables.
</li>
<li>Royals never mingle with the common folk but prefer to stick to their class.
</li>
<li>John was able to mingle with the other students and ended up feeling right at home at college.
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-59" class="outline-2">
<h2 id="sec-59"><span class="section-number-2">59</span> <a href="https://wordsinasentence.com/mirth-in-a-sentence/">Mirth</a></h2>
<div class="outline-text-2" id="text-59">
<p>
<code>amusement and joy</code>
</p>

<ul class="org-ul">
<li>It was obvious from Jacob’s mirth he found the movie to be quite funny.
</li>
<li>When my stern father gives out consequences for bad behavior, he never displays any mirth.
</li>
<li>The teacher tried to hide her mirth when she learned her worst student had been suspended for seven days.
</li>
<li>With a twinkle of mirth in his eyes, Santa Claus winked at the small child before going back up the chimney.
</li>
</ul>
</div>
</div>




<div id="outline-container-sec-60" class="outline-2">
<h2 id="sec-60"><span class="section-number-2">60</span> <a href="https://wordsinasentence.com/miscreant-in-a-sentence/">Miscreant</a></h2>
<div class="outline-text-2" id="text-60">
<p>
<code>an individual who has misbehaved</code>
</p>

<ul class="org-ul">
<li>The principal took the miscreant out of my classroom and placed him in the in-school suspension room.
</li>
<li>Sometimes when Jim acts like a miscreant, his wife kicks him out of the house.
</li>
<li>For the computer savvy miscreant, it is a great age in which to be a hacker.
</li>
<li>How long is it going to take the police to capture the miscreant who keeps knocking down mailboxes in our neighborhood?
</li>
<li>Everyone is shocked a proper lady like April is dating a miscreant like James.
</li>
<li>Because James is a miscreant with a felony record for murder, he cannot become a police officer.
</li>
<li>The church installed cameras outside in hopes of catching the miscreant who was vandalizing the building.
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-61" class="outline-2">
<h2 id="sec-61"><span class="section-number-2">61</span> <a href="https://wordsinasentence.com/misgiving-in-a-sentence/">Misgiving</a></h2>
<div class="outline-text-2" id="text-61">
<p>
<code>a feeling of doubt</code>
</p>

<ul class="org-ul">
<li>When I learned my daughter’s boyfriend had just been released from prison, my misgiving about him became stronger.
</li>
<li>James overlooked his misgiving about the new job because he really needed to pay his rent.
</li>
<li>Despite the actor’s misgiving about the film, he accepted the role and won an Academy Award for his efforts.
</li>
<li>Helen had a terrible misgiving she might have rushed into her relationship with Mark too soon.
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-62" class="outline-2">
<h2 id="sec-62"><span class="section-number-2">62</span> <a href="https://wordsinasentence.com/mistrial-in-a-sentence/">Mistrial</a></h2>
<div class="outline-text-2" id="text-62">
<p>
<code>a trial that ends through an error in the proceedings</code>
</p>

<ul class="org-ul">
<li>Bill Cosby’s rape hearing ended in a mistrial since the jurors were deadlocked and couldn’t come to a decision.
</li>
<li>The judge declared a mistrial, ruling that the entire proceeding invalid after a juror admitted to knowing the defendant.
</li>
<li>Even though they knew that they could try the killer again, the mistrial was a disappointment to the district attorney and his staff.
</li>
<li>A mistrial was ruled when the judge felt that a problem with a witness would make it impossible for a fair decision to be reached.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-63" class="outline-2">
<h2 id="sec-63"><span class="section-number-2">63</span> <a href="https://wordsinasentence.com/moan-in-a-sentence/">Moan</a></h2>
<div class="outline-text-2" id="text-63">
<p>
<code>A long low sound used to express physical or mental suffering</code>
</p>

<ul class="org-ul">
<li>Letting out a painful moan, the trapped motorist hoped someone would hear his cry.
</li>
<li>Laying all alone in his den, the lonely lion let out a deep moan.
</li>
<li>The injured player continued to moan as he gripped his hurt leg.
</li>
<li>Following the sound of the groaning animal, the vet was able to find the source of the moan and help the dog get well.
</li>
</ul>
</div>
</div>
