ruby/M.org
* [[https://wordsinasentence.com/mote-in-a-sentence/][Mote]]

  =a tiny piece of something=

  - A small mote of glass entered my foot, so tiny that I wasn’t able to pull it out without *tweezers*.
  - Feeling a mote of dirt in her eye, the woman rushed to the bathroom to wash the speck out.
  - A mote of sand in the girl’s shoe irritated her until she stopped to wipe it away.
  - Feeling anxious about the state of her home, the obsessive housewife scrubbed away every tiny mote of dust.



* [[https://wordsinasentence.com/motility-in-a-sentence/][Motility]]

  =the ability to move around in fluid=

  - *Personal lubricants* can interfere with sperm motility and hinder sperm from being able to make it to the egg.
  - Some bacteria have flagellin, which aid in motility and help the cells move through liquid.
  - Studies have proven that marijuana use can slow down sperm motility in otherwise healthy men.
  - Sarcoma cells have increased motility, allowing for faster spreading of these particular types of cancer.



* [[https://wordsinasentence.com/muck-in-a-sentence/][Muck]]

  =muck is dirt or waste=

  - Our old truck was filthy since it was covered with gravel, muck, and dirt.
  - The farm’s animal pens were filled with muck and waste from the pigs and horses.
  - After he played in the muddy yard, the boy’s boots were covered with muck.
  - There was a layer of grimy clay, soil, and muck on the road that lead to the hunting camp.



* [[https://wordsinasentence.com/muffle-in-a-sentence/][Muffle]]

  =to deaden sound by covering or wrapping=

  - A silencer was placed on the gun to muffle the sound of it being shot.
  - To muffle some of the noise, *placemats* will be placed on the gym floor.
  - Although living beside a highway can be a challenge, keeping your windows closed can muffle some of the street noise.



* [[https://wordsinasentence.com/mull-in-a-sentence/][Mull]]

  =to think about something deeply and for a long period of time=

  - As she continued to mull over the long list of potential performers, the entertainment director wondered if she should just feature someone internally.
  - The player had all summer to mull over his decision to go to college versus heading directly into the NFL.
  - The jury needed the weekend to mull over the evidence and make a decision on the case.
  - Taking some time to mull over your thoughts and get your emotions in check leads to better decision making.



* [[https://wordsinasentence.com/mumble-in-a-sentence/][Mumble]]

  =to mutter something in a low tone so that it cannot be understood=

  - My little brother will mumble his grievances *under his breath* =屏住呼吸= but never tell me when I make him angry.
  - The irritated worker continued to grumble and mumble about his no-good boss just out of everyone’s earshot.
  - As he continued to mumble profanity under his breath, the enraged driver laid on the horn.
  - Shrugging her shoulders and walking away, the confused assistant mumbled a slight protest to herself.



* [[https://wordsinasentence.com/muse-in-a-sentence/][Muse]]

  =something or someone that inspires=

  - The model was the artist’s muse for his famous sculpture.
  - When the composer wanted inspiration for a love song, he would stare at the muse he had been married to for over thirty years.
  - My infant daughter was the muse who inspired me to get healthy by losing weight.
  - According to mythology, a muse is any of the nine daughters of Zeus and Mnemosyne who inspire knowledge and creativity among men.



* [[https://wordsinasentence.com/mushy-in-a-sentence/][Mushy]]

  =having a *soggy* and squashy consistency=

  - After cooking the peas for too long in a crockpot, the mushy vegetable was too soft to be delicious.
  - Due to the extensive rain showers, the mushy ground required everyone to wear boots or their shoes would sink into the mud.
  - Since the bananas were overripe, my teeth simply sunk into the mushy fruit without really having to chew it.
  - After beginning to walk through the dog park, my foot stepped into a mushy pile which made me realize it was loose dog poop.



* [[https://wordsinasentence.com/muster-in-a-sentence/][Muster]]

  =to gather collectively=

  - Before the cruise ship departs, passengers are required to muster at a specified station for a safety *briefing* =情况通报会=.
  - Tomorrow the teachers will muster for their monthly staff meeting.
  - At the sound of the trumpet, the troops muster in standard formation.
  - The two football teams muster in their respective *huddles* before each play.
  - According to legend, witches muster on Halloween night to celebrate the dark spirits.
  - The knights muster in the great room to hear the words of their king.
  - When my mother wants us to spring clean, she blows a whistle to let us know it is time to muster in the kitchen.



* [[https://wordsinasentence.com/mutinous-in-a-sentence/][Mutinous]]

  =not following orders; rebelling against authority=

  - Can you believe the bodyguard was the head of the mutinous plot to kill the king?
  - Mutinous employees are protesting low wages by not showing up for work.
  - During the war, the mutinous soldier attacked his commanding officer.
  - Selling classified government documents is a mutinous action.



* [[https://wordsinasentence.com/mutter-in-a-sentence/][Mutter]]

  =to speak under one's breath, usually in an angry way=

  - As he walked away to do his chores, his mother heard him mutter under his breath.
  - Complaining with a mutter, the man *stomped out* the door as he made his remarks.
  - He *huffed* and puffed with a mutter, moaning about how difficult it would be to find a new carpenter at last minute.
  - With a grumble and a mutter, the elderly woman tightened her coat and marched off to face the harsh winter weather in search for firewood.




#+HTML: <a id="bottom"/>
#+HTML: <a href="#top">⇧</a>