ruby/M.html



<div id="outline-container-sec-74" class="outline-2">
<h2 id="sec-74"><span class="section-number-2">74</span> <a href="https://wordsinasentence.com/mote-in-a-sentence/">Mote</a></h2>
<div class="outline-text-2" id="text-74">
<p>
<code>a tiny piece of something</code>
</p>

<ul class="org-ul">
<li>A small mote of glass entered my foot, so tiny that I wasn’t able to pull it out without tweezers.
</li>
<li>Feeling a mote of dirt in her eye, the woman rushed to the bathroom to wash the speck out.
</li>
<li>A mote of sand in the girl’s shoe irritated her until she stopped to wipe it away.
</li>
<li>Feeling anxious about the state of her home, the obsessive housewife scrubbed away every tiny mote of dust.
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-75" class="outline-2">
<h2 id="sec-75"><span class="section-number-2">75</span> <a href="https://wordsinasentence.com/motility-in-a-sentence/">Motility</a></h2>
<div class="outline-text-2" id="text-75">
<p>
<code>the ability to move around in fluid</code>
</p>

<ul class="org-ul">
<li>Personal lubricants can interfere with sperm motility and hinder sperm from being able to make it to the egg.
</li>
<li>Some bacteria have flagellin, which aid in motility and help the cells move through liquid.
</li>
<li>Studies have proven that marijuana use can slow down sperm motility in otherwise healthy men.
</li>
<li>Sarcoma cells have increased motility, allowing for faster spreading of these particular types of cancer.
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-76" class="outline-2">
<h2 id="sec-76"><span class="section-number-2">76</span> <a href="https://wordsinasentence.com/muck-in-a-sentence/">Muck</a></h2>
<div class="outline-text-2" id="text-76">
<p>
<code>muck is dirt or waste</code>
</p>

<ul class="org-ul">
<li>Our old truck was filthy since it was covered with gravel, muck, and dirt.
</li>
<li>The farm’s animal pens were filled with muck and waste from the pigs and horses.
</li>
<li>After he played in the muddy yard, the boy’s boots were covered with muck.
</li>
<li>There was a layer of grimy clay, soil, and muck on the road that lead to the hunting camp.
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-77" class="outline-2">
<h2 id="sec-77"><span class="section-number-2">77</span> <a href="https://wordsinasentence.com/muffle-in-a-sentence/">Muffle</a></h2>
<div class="outline-text-2" id="text-77">
<p>
<code>to deaden sound by covering or wrapping</code>
</p>

<ul class="org-ul">
<li>Example sentences for Fiduciary. Read this page and learn how to use Fiduciary in a sentence.
</li>
<li>A silencer was placed on the gun to muffle the sound of it being shot.
</li>
<li>To muffle some of the noise, placemats will be placed on the gym floor.
</li>
<li>Although living beside a highway can be a challenge, keeping your windows closed can muffle some of the street noise.
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-78" class="outline-2">
<h2 id="sec-78"><span class="section-number-2">78</span> <a href="https://wordsinasentence.com/mull-in-a-sentence/">Mull</a></h2>
<div class="outline-text-2" id="text-78">
<p>
<code>to think about something deeply and for a long period of time</code>
</p>

<ul class="org-ul">
<li>As she continued to mull over the long list of potential performers, the entertainment director wondered if she should just feature someone internally.
</li>
<li>The player had all summer to mull over his decision to go to college versus heading directly into the NFL.
</li>
<li>The jury needed the weekend to mull over the evidence and make a decision on the case.
</li>
<li>Taking some time to mull over your thoughts and get your emotions in check leads to better decision making.
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-79" class="outline-2">
<h2 id="sec-79"><span class="section-number-2">79</span> <a href="https://wordsinasentence.com/mumble-in-a-sentence/">Mumble</a></h2>
<div class="outline-text-2" id="text-79">
<p>
<code>to mutter something in a low tone so that it cannot be understood</code>
</p>

<ul class="org-ul">
<li>My little brother will mumble his grievances under his breath but never tell me when I make him angry.
</li>
<li>The irritated worker continued to grumble and mumble about his no-good boss just out of everyone’s earshot.
</li>
<li>As he continued to mumble profanity under his breath, the enraged driver laid on the horn.
</li>
<li>Shrugging her shoulders and walking away, the confused assistant mumbled a slight protest to herself.
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-80" class="outline-2">
<h2 id="sec-80"><span class="section-number-2">80</span> <a href="https://wordsinasentence.com/muse-in-a-sentence/">Muse</a></h2>
<div class="outline-text-2" id="text-80">
<p>
<code>something or someone that inspires</code>
</p>

<ul class="org-ul">
<li>The model was the artist’s muse for his famous sculpture.
</li>
<li>When the composer wanted inspiration for a love song, he would stare at the muse he had been married to for over thirty years.
</li>
<li>My infant daughter was the muse who inspired me to get healthy by losing weight.
</li>
<li>According to mythology, a muse is any of the nine daughters of Zeus and Mnemosyne who inspire knowledge and creativity among men.
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-81" class="outline-2">
<h2 id="sec-81"><span class="section-number-2">81</span> <a href="https://wordsinasentence.com/mushy-in-a-sentence/">Mushy</a></h2>
<div class="outline-text-2" id="text-81">
<p>
<code>having a soggy and squashy consistency</code>
</p>

<ul class="org-ul">
<li>After cooking the peas for too long in a crockpot, the mushy vegetable was too soft to be delicious.
</li>
<li>Due to the extensive rain showers, the mushy ground required everyone to wear boots or their shoes would sink into the mud.
</li>
<li>Since the bananas were overripe, my teeth simply sunk into the mushy fruit without really having to chew it.
</li>
<li>After beginning to walk through the dog park, my foot stepped into a mushy pile which made me realize it was loose dog poop.
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-82" class="outline-2">
<h2 id="sec-82"><span class="section-number-2">82</span> <a href="https://wordsinasentence.com/muster-in-a-sentence/">Muster</a></h2>
<div class="outline-text-2" id="text-82">
<p>
<code>to gather collectively</code>
</p>

<ul class="org-ul">
<li>Before the cruise ship departs, passengers are required to muster at a specified station for a safety briefing.
</li>
<li>Tomorrow the teachers will muster for their monthly staff meeting.
</li>
<li>At the sound of the trumpet, the troops muster in standard formation.
</li>
<li>The two football teams muster in their respective huddles before each play.
</li>
<li>According to legend, witches muster on Halloween night to celebrate the dark spirits.
</li>
<li>The knights muster in the great room to hear the words of their king.
</li>
<li>When my mother wants us to spring clean, she blows a whistle to let us know it is time to muster in the kitchen.
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-83" class="outline-2">
<h2 id="sec-83"><span class="section-number-2">83</span> <a href="https://wordsinasentence.com/mutinous-in-a-sentence/">Mutinous</a></h2>
<div class="outline-text-2" id="text-83">
<p>
<code>not following orders; rebelling against authority</code>
</p>

<ul class="org-ul">
<li>Can you believe the bodyguard was the head of the mutinous plot to kill the king?
</li>
<li>Mutinous employees are protesting low wages by not showing up for work.
</li>
<li>During the war, the mutinous soldier attacked his commanding officer.
</li>
<li>Selling classified government documents is a mutinous action.
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-84" class="outline-2">
<h2 id="sec-84"><span class="section-number-2">84</span> <a href="https://wordsinasentence.com/mutter-in-a-sentence/">Mutter</a></h2>
<div class="outline-text-2" id="text-84">
<p>
<code>to speak under one's breath, usually in an angry way</code>
</p>

<ul class="org-ul">
<li>As he walked away to do his chores, his mother heard him mutter under his breath.
</li>
<li>Complaining with a mutter, the man stomped out the door as he made his remarks.
</li>
<li>He huffed and puffed with a mutter, moaning about how difficult it would be to find a new carpenter at last minute.
</li>
<li>With a grumble and a mutter, the elderly woman tightened her coat and marched off to face the harsh winter weather in search for firewood.
</li>
</ul>




<a id="bottom"/>
<a href="#top">⇧</a>
</div>
</div>
</div>
</body>
</html>